{
  "The Fool": {
    "general": {
      "upright": "The Fool upright represents the start of a new journey filled with potential and curiosity. It’s about taking a leap of faith and exploring new experiences with an open mind. Even if the path isn’t clear, this card encourages trust in the process and reminds you that growth often comes from stepping into the unknown. This card can be a call to let go of control and embrace spontaneity and innocence, though it cautions that this requires a balance between being carefree and not being completely reckless.",
      "reversed": "The Fool reversed warns against being careless or unprepared. You might be acting impulsively or ignoring important details. Take a moment to plan before jumping into something new, and remember that freedom is most rewarding when balanced with awareness. The reversed Fool is a warning to be cautious and to examine if you are ignoring \"red flags\" or making decisions based on wishful thinking rather than reality. It may also suggest you are repeating past mistakes, even if the situation looks new, or that you need to learn from your history to avoid future pitfalls."
    },
    "love": {
      "upright": "This card can point to new connections, open communication, and emotional curiosity. It’s a reminder to approach people and relationships with honesty and optimism, while staying aware of boundaries. For existing relationships,  It can signal a need for a change of pace in a long-term relationship, suggesting a new shared goal or activity to reawaken intimacy. While the card encourages you to jump in, it also carries a gentle caution. The Fool is heading towards the unknown, so it's important to balance this new adventure with a degree of mindfulness to avoid potential pitfalls.",
      "reversed": "Reversed, it suggests being cautious in how you engage with others. Someone may be acting without thinking, or there could be misunderstandings caused by poor communication. Take time to clarify intentions and expectations. It may also indicate a fear of commitment or reluctance to take emotional risks, urging you to reflect on what’s holding you back. Avoid rushing into relationships without considering the consequences."
    },
    "career": {
      "upright": "The Fool upright signals new beginnings in your career or studies — such as taking on new challenges, starting a project, or exploring creative ideas. It’s a call to embrace learning and stay adaptable. The Fool's meaning encourages you to take a risk and step into the unknown with confidence, rather than letting fear hold you back. This card reminds you that every expert was once a beginner, and that growth often comes from trying new things. This card may also suggest a need to let go of rigid plans and be open to unexpected opportunities that arise.",
      "reversed": "When reversed, it can mean rushing decisions or ignoring preparation in your work. Be mindful of details and take steady steps instead of risky leaps. Avoid overconfidence or unrealistic expectations. It may also indicate a fear of change or reluctance to take necessary risks, urging you to reflect on what’s holding you back. Don’t let hesitation prevent you from pursuing new opportunities that could lead to growth. This card may also suggest overwhelm - taking on more than you are ready for or feeling like your plate is too full. Prioritize and focus on what matters most."
    }
  },
  "The Magician": {
    "general": {
      "upright": "The Magician upright highlights skill, confidence, and the power to create change. You have the tools and ability to turn ideas into reality. It’s a strong reminder that focus and intention shape your outcomes. This card encourages you to harness your talents and take inspired action toward your goals. It’s about being proactive and using your resources wisely. The Magician also suggests that you are in a phase of manifestation, where your thoughts and actions are aligned with your desires. Stay clear on what you want and believe in your ability to achieve it.",
      "reversed": "Reversed, The Magician may point to self-doubt or unfulfilled potential. You might not be using your skills effectively or could be distracted by too many directions. Stay honest with yourself and refine your focus. Avoid manipulation or shortcuts — true success comes from integrity and effort. This card can also indicate a lack of confidence or feeling disconnected from your abilities. Reflect on what’s blocking your progress and take steps to rebuild your self-belief."
    },
    "love": {
      "upright": "In relationships, this card shows clear communication and mutual understanding. It’s about connecting through honesty and intention rather than surface-level attraction. The Magician encourages you to be proactive in expressing your needs and desires in your relationships. It’s a reminder that you have the power to shape your emotional connections through your actions and words. This card can also suggest a time of new beginnings or rekindling passion in existing relationships by focusing on what truly matters. It’s a call to be authentic and intentional in how you relate to others.",
      "reversed": "Reversed, it can signal confusion or miscommunication between people. Be wary of mixed messages or unrealistic expectations. Clarity and sincerity will help restore balance. This card may also indicate manipulation or deceit, urging you to stay true to yourself and avoid being swayed by others. Reflect on whether you are being honest in your interactions and if your relationships are built on genuine connection. Take time to clarify your feelings and intentions before making decisions. It may also suggest a lack of confidence in expressing your emotions, leading to misunderstandings or missed opportunities for deeper connection."
    },
    "career": {
      "upright": "Career-wise, The Magician upright indicates using your strengths, skills, and creativity to make progress. You’re capable of leading or initiating something meaningful if you focus your energy. This card encourages you to take initiative and believe in your ability to influence outcomes. It’s a time for action and manifestation, where your ideas can come to life through dedication and effort. The Magician also suggests that you have the resources you need to succeed, whether it’s knowledge, connections, or tools. Stay confident and proactive in pursuing your career goals. This card may also indicate a time of innovation or entrepreneurship, where you are encouraged to think outside the box and take calculated risks to achieve success.",
      "reversed": "Reversed, this card can represent missed opportunities or lack of motivation. Avoid overpromising or underdelivering — consistency matters more than speed. It may also indicate feeling overwhelmed or scattered, making it hard to focus on what’s important. Take time to regroup and prioritize your tasks. This card can also suggest a lack of confidence in your abilities or feeling disconnected from your work. Reflect on what’s blocking your progress and take steps to rebuild your self-belief. Avoid shortcuts or unethical behavior, as true success comes from integrity and effort."
    }
  },
  "The High Priestess": {
    "general": {
      "upright": "The High Priestess upright represents intuition, reflection, and inner knowledge. It’s a reminder to pause and listen to your instincts before taking action. Not everything needs to be solved logically — some answers come from awareness and observation. This card encourages patience and trust in the process, suggesting that clarity will come with time. The High Priestess also signifies a connection to deeper wisdom and the subconscious mind. It’s a call to explore your inner world and embrace the mysteries of life. This card may also indicate a need for balance between your external actions and internal reflections, urging you to find harmony between doing and being.",
      "reversed": "Reversed, it may suggest ignoring your inner voice or doubting your judgment. You could also be avoiding a truth that’s trying to surface. Reflect quietly before reacting — awareness will guide you. This card can also indicate a lack of clarity or feeling disconnected from your intuition. Take time to slow down and reconnect with your inner self. Avoid rushing into decisions without considering your deeper feelings and insights. The reversed High Priestess may also point to secrets or hidden information that needs to be acknowledged before moving forward."
    },
    "love": {
      "upright": "This card suggests emotional understanding and deeper insight into how you connect with others. It encourages patience and listening before making assumptions. Trust your intuition about people and situations. It may also indicate a time of emotional growth or spiritual connection in relationships, where you are learning to communicate on a deeper level. The High Priestess encourages you to be open to the mysteries of love and to embrace the unknown aspects of your connections. It’s a reminder that not everything needs to be explained or understood immediately — some things unfold naturally over time.",
      "reversed": "Reversed, it can point to hidden feelings or lack of transparency between people. Don’t rush decisions — clarity comes with honest communication and time. Avoid ignoring red flags or dismissing your gut feelings. This card may also indicate emotional confusion or misunderstandings, urging you to take a step back and reflect on your true feelings. Be patient with yourself and others as you navigate complex emotions. The reversed High Priestess may also suggest that you are not fully in tune with your own needs and desires, leading to uncertainty in your relationships. Take time to reconnect with yourself and clarify what you truly want before making decisions."
    },
    "career": {
      "upright": "The High Priestess upright indicates that patience and intuition will help in your career. It’s a great time to observe, research, or study before acting. Knowledge is your strength. This card encourages you to trust your instincts and inner wisdom when making career decisions. It may also suggest that you are in a phase of learning or reflection, where gaining deeper understanding will lead to future success. The High Priestess reminds you that not all progress is visible — sometimes the most important work happens behind the scenes or within your own mind. Stay open to insights and be patient as your career path unfolds.",
      "reversed": "When reversed, it can mean ignoring useful advice or working without full information. Slow down and check facts before committing to major choices. Avoid rushing into decisions without considering your deeper feelings and insights. This card may also indicate feeling disconnected from your work or unsure of your next steps. Take time to reflect on your career goals and what truly matters to you. The reversed High Priestess may also suggest that you are not fully in tune with your own abilities and potential, leading to uncertainty in your professional life. Reconnect with your strengths and trust in your capacity to succeed."
    }
  },
  "The Empress": {
    "general": {
      "upright": "The Empress upright represents creativity, growth, and nurturing energy. It’s about developing ideas with care and patience, and appreciating the process of creation. This card signals abundance and emotional balance. It encourages you to connect with nature and your senses, finding joy in the present moment. The Empress also highlights the importance of self-care and nurturing your own well-being. This card may suggest a time of fertility, whether literally or metaphorically, where new projects or relationships are blossoming. Embrace your creativity and allow yourself to grow in a supportive environment. It’s a reminder that nurturing others starts with nurturing yourself.",
      "reversed": "Reversed, The Empress can suggest creative blockages or dependence on others for validation. Focus on rebuilding confidence and reconnecting with what inspires you. Avoid neglecting self-care or overextending yourself. This card may also indicate a lack of balance between giving and receiving, urging you to set healthy boundaries. Reflect on whether you are taking care of your own needs and allowing space for your creativity to flourish. The reversed Empress may also point to issues with self-worth or feeling disconnected from your own nurturing energy. Take time to reconnect with yourself and prioritize your well-being. Remember that true growth comes from a foundation of self-love and care."
    },
    "love": {
      "upright": "This card highlights warmth, empathy, and emotional care in connections. It encourages building mutual respect and understanding. Nurture relationships with kindness and patience. The Empress suggests a time of emotional growth and deepening bonds, where you are learning to support and care for each other. It may also indicate a period of fertility or new beginnings in relationships, where love is blossoming and flourishing. Embrace the nurturing energy of this card and allow your connections to grow naturally. It’s a reminder that love thrives in an environment of care and attention.",
      "reversed": "Reversed, it may point to emotional imbalance or overprotectiveness. Give space for independence and communication to grow naturally. Avoid smothering or neglecting your own needs. This card may also indicate issues with self-worth or feeling disconnected from your own nurturing energy, which can affect your relationships. Take time to reconnect with yourself and prioritize your well-being. Reflect on whether you are giving too much or not enough in your connections, and strive for a healthy balance. The reversed Empress may also suggest that you are not fully in tune with your own emotions, leading to misunderstandings or tension in relationships. Be honest about your feelings and communicate openly to restore harmony."
    },
    "career": {
      "upright": "In career, The Empress suggests success through collaboration, creativity, and leadership that supports others. It’s about fostering a positive environment that helps everyone thrive. This card encourages you to nurture your ideas and projects with care, allowing them to develop naturally. It may also indicate a time of abundance and growth in your professional life, where your efforts are being recognized and rewarded. The Empress reminds you that true success comes from a balance of hard work and self-care, urging you to prioritize your well-being as you pursue your career goals. Embrace your creative potential and lead with empathy and understanding. It’s a reminder that nurturing others starts with nurturing yourself.",
      "reversed": "Reversed, it can mean lack of inspiration or burnout. Reassess your goals and find ways to reconnect with your passion for the work you do. Avoid neglecting self-care or overextending yourself. It may also indicate issues with self-worth or feeling disconnected from your own nurturing energy, which can affect your professional life. Take time to reconnect with yourself and prioritize your well-being. Reflect on whether you are giving too much or not enough in your work, and strive for a healthy balance. The reversed Empress may also suggest that you are not fully in tune with your own abilities and potential, leading to uncertainty in your career. Reconnect with your strengths and trust in your capacity to succeed."
    }
  },
  "The Emperor": {
    "general": {
      "upright": "The Emperor upright represents structure, discipline, and strong leadership. It’s about taking control, setting boundaries, and staying organized to reach your goals. This card encourages you to be assertive and confident in your decisions, while also being fair and responsible. The Emperor signifies stability and authority, reminding you that true power comes from a foundation of integrity and consistency. It may also indicate a time of growth and achievement, where your efforts are being recognized and rewarded. Embrace your leadership potential and take charge of your path with confidence and clarity.",
      "reversed": "Reversed, The Emperor warns against being overly controlling or rigid. Learn to balance authority with flexibility — true power comes from stability, not dominance. Avoid being inflexible or dismissive of others’ perspectives. This card may also indicate issues with authority or feeling powerless, urging you to reflect on where you can regain control in your life. Take time to reassess your goals and find ways to reconnect with your sense of purpose. The reversed Emperor may also suggest that you are not fully in tune with your own strengths and potential, leading to uncertainty in your path. Reconnect with your inner authority and trust in your ability to lead with integrity and confidence."
    },
    "love": {
      "upright": "This card suggests stability and commitment in your connections. It’s about showing reliability and building trust through consistency. Strong communication and respect for boundaries are key. The Emperor encourages you to take a leadership role in your relationships, setting clear expectations and being dependable. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a structured way. Embrace the stability and security that comes from mutual respect and understanding. It’s a reminder that strong relationships are built on a foundation of trust and reliability.",
      "reversed": "Reversed, it can indicate tension caused by control issues or misaligned expectations. Cooperation and respect are needed to restore balance. Avoid being overly rigid or dismissive of your partner’s needs. This card may also suggest issues with authority or feeling powerless in your relationships, urging you to reflect on where you can regain control and assert your boundaries. Take time to reassess your connections and find ways to communicate openly and honestly. The reversed Emperor may also indicate a lack of confidence in expressing your needs and desires, leading to misunderstandings or tension in relationships. Be honest about your feelings and communicate openly to restore harmony."
    },
    "career": {
      "upright": "Career-wise, The Emperor upright means leadership, discipline, and structure. You’re encouraged to take responsibility and approach your goals with focus. This card signifies a time of growth and achievement in your professional life, where your efforts are being recognized and rewarded. Embrace your leadership potential and take charge of your career path with confidence and clarity. It’s a reminder that true success comes from a foundation of integrity and consistency. Stay organized and set clear boundaries to maintain balance and productivity.",
      "reversed": "When reversed, it can point to poor management or frustration with authority. Stay composed and set clear boundaries to protect your work values. Avoid being overly rigid or dismissive of others’ perspectives. This card may also indicate issues with authority or feeling powerless in your professional life, urging you to reflect on where you can regain control and assert your boundaries. Take time to reassess your career goals and find ways to reconnect with your sense of purpose. The reversed Emperor may also suggest that you are not fully in tune with your own strengths and potential, leading to uncertainty in your career path. Reconnect with your inner authority and trust in your ability to lead with integrity and confidence."
    }
  },
  "The Hierophant": {
    "general": {
      "upright": "The Hierophant upright represents tradition, learning, and shared values. It’s about seeking wisdom through structure, mentors, or established systems. This card encourages learning from experience and community. It may also indicate a time of spiritual growth or deeper understanding, where you are exploring your beliefs and finding what feels authentic to you. The Hierophant reminds you that while tradition can provide valuable guidance, it’s important to balance it with your own insights and experiences. Embrace the wisdom of others while staying true to your own path. It’s a call to find harmony between external teachings and your inner truth.",
      "reversed": "Reversed, it points to questioning traditions or breaking away from rigid expectations. You may be exploring your own beliefs and finding what feels authentic. Avoid blindly following rules that don’t resonate with you. This card may also indicate a need to challenge outdated systems or beliefs that no longer serve your growth. Reflect on where you can create your own path and embrace your individuality. The reversed Hierophant encourages you to find balance between honoring tradition and forging your own way, reminding you that true wisdom comes from both external teachings and internal understanding."
    },
    "love": {
      "upright": "In connections, this card represents shared values and mutual respect. It can also mean learning to understand each other’s perspectives through open dialogue. Tradition and commitment may play a role. The Hierophant encourages you to build relationships based on trust, respect, and shared beliefs. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a structured way. Embrace the stability and security that comes from mutual respect and understanding. It’s a reminder that strong relationships are built on a foundation of trust and shared values.",
      "reversed": "Reversed, it may indicate differing beliefs or unconventional dynamics. Flexibility and honest discussion can help bridge the gap. Avoid imposing rigid expectations on your partner. This card may also suggest issues with authority or feeling powerless in your relationships, urging you to reflect on where you can regain control and assert your boundaries. Take time to reassess your connections and find ways to communicate openly and honestly. The reversed Hierophant may also indicate a lack of confidence in expressing your needs and desires, leading to misunderstandings or tension in relationships. Be honest about your feelings and communicate openly to restore harmony. It may also suggest a desire to break free from traditional relationship roles or expectations, encouraging you to explore what works best for you and your partner rather than conforming to societal norms."
    },
    "career": {
      "upright": "In career, The Hierophant upright suggests learning from mentors or following structured paths like training and education. It’s a time for discipline and commitment. This card encourages you to seek guidance from experienced individuals and to embrace established systems that can support your growth. It may also indicate a time of spiritual or professional growth, where you are exploring your values and finding what feels authentic to you in your work. The Hierophant reminds you that while tradition can provide valuable guidance, it’s important to balance it with your own insights and experiences. Embrace the wisdom of others while staying true to your own path. It’s a call to find harmony between external teachings and your inner truth. This card may also suggest a need to conform to workplace norms or expectations, urging you to find ways to express your individuality within the structure of your professional environment.",
      "reversed": "Reversed, it may mean exploring nontraditional paths or challenging outdated systems. Innovation can lead to progress when balanced with wisdom. Avoid blindly following rules that don’t resonate with you. This card may also indicate a need to challenge outdated systems or beliefs that no longer serve your growth. Reflect on where you can create your own path and embrace your individuality. The reversed Hierophant encourages you to find balance between honoring tradition and forging your own way, reminding you that true wisdom comes from both external teachings and internal understanding. It may also suggest feeling disconnected from your work or unsure of your next steps, urging you to take time to reflect on your career goals and what truly matters to you."
    }
  },
  "The Lovers": {
    "general": {
      "upright": "The Lovers upright represents alignment, trust, and making choices that reflect your values. It’s about balance between logic and emotion, and being true to what matters most. This card encourages you to embrace vulnerability and open communication, whether in relationships or personal decisions. It may also indicate a time of growth and deepening understanding, where you are learning to integrate different aspects of yourself. The Lovers reminds you that true harmony comes from being authentic and making choices that honor your whole self. It’s a call to find balance between your head and heart, and to trust in the process of connection and self-discovery. It’s also a reminder that the choices you make now can have a lasting impact on your path, so take time to reflect on what truly matters to you.",
      "reversed": "Reversed, this card may point to inner conflict or poor decision-making due to misalignment. Reflect on what’s truly right for you instead of what’s easy. Avoid rushing into choices without considering your deeper values and feelings. This card may also indicate misunderstandings or lack of trust in relationships, urging you to communicate openly and honestly. Take time to reassess your connections and find ways to restore balance and harmony. The reversed Lovers encourages you to find alignment within yourself before seeking it in others, reminding you that true connection starts with self-love and authenticity. It may also suggest a fear of commitment or reluctance to take emotional risks, urging you to reflect on what’s holding you back. Avoid making decisions based on external pressures or societal expectations, and instead focus on what feels right for you."
    },
    "love": {
      "upright": "This card represents harmony and cooperation in relationships or friendships. It highlights mutual respect and emotional balance. Open communication is key. The Lovers encourages you to build relationships based on trust, respect, and shared values. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a meaningful way. Embrace the harmony and connection that comes from being authentic and true to yourself. It’s a reminder that strong relationships are built on a foundation of trust and mutual understanding. This card may also suggest a significant choice or commitment in your relationships, urging you to consider what truly matters to you and to make decisions that honor your values and desires.",
      "reversed": "Reversed, it can signal misunderstandings or imbalance. Communication and self-awareness can help rebuild clarity and trust. The reversed Lovers encourages you to find alignment within yourself before seeking it in others, reminding you that true connection starts with self-love and authenticity. It may also suggest a fear of commitment or reluctance to take emotional risks, urging you to reflect on what’s holding you back. Avoid making decisions based on external pressures or societal expectations, and instead focus on what feels right for you. Take time to reassess your relationships and find ways to restore balance and harmony. Be honest about your feelings and communicate openly to rebuild trust and understanding."
    },
    "career": {
      "upright": "In career, The Lovers upright signifies good teamwork and shared goals. It’s about making decisions that align with your values. Collaboration and clear communication lead to success. This card encourages you to build professional relationships based on trust, respect, and shared objectives. It may also indicate a time of growth and achievement in your career, where your efforts are being recognized and rewarded. Embrace the harmony and connection that comes from working with others who share your vision. It’s a reminder that strong professional relationships are built on a foundation of trust and mutual understanding. This card may also suggest a significant choice or commitment in your career, urging you to consider what truly matters to you and to make decisions that honor your values and aspirations.",
      "reversed": "Reversed, it warns of conflicts or misaligned interests in partnerships. Reflect before committing to collaborations or contracts. Clear communication is essential. The reversed Lovers encourages you to find alignment within yourself before seeking it in others, reminding you that true success starts with self-awareness and authenticity. It may also suggest a fear of commitment or reluctance to take professional risks, urging you to reflect on what’s holding you back. Avoid making decisions based on external pressures or societal expectations, and instead focus on what feels right for you. Take time to reassess your professional relationships and find ways to restore balance and harmony. Be honest about your goals and communicate openly to rebuild trust and understanding."
    }
  },
  "The Chariot": {
    "general": {
      "upright": "The Chariot upright represents determination, focus, and self-discipline. It’s a card of progress and victory through persistence and confidence. You have the ability to overcome obstacles by harnessing your willpower and staying on course. This card encourages you to take control of your path and steer your life in the direction you want to go. It may also indicate a time of growth and achievement, where your efforts are being recognized and rewarded. Embrace your inner strength and stay committed to your goals, knowing that success comes from a balance of effort and self-control. The Chariot reminds you that while challenges may arise, your determination and focus will lead you to triumph.",
      "reversed": "Reversed, it can mean lack of direction or inner conflict. Reevaluate your goals before pushing forward — clarity will help regain control. Avoid forcing progress without a clear plan. This card may also indicate burnout or losing motivation, urging you to take a step back and reconnect with your purpose. Reflect on what’s blocking your progress and take steps to regain your focus and determination. The reversed Chariot encourages you to find balance between effort and self-care, reminding you that true success comes from a foundation of clarity and inner strength. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card indicates progress and teamwork in emotional connections. Balance independence with shared goals. Clear communication drives success. The Chariot encourages you to work together with your partner or potential connections towards common objectives, while also respecting each other’s individuality. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a dynamic way. Embrace the momentum and energy that comes from working together towards shared goals. It’s a reminder that strong relationships thrive on a balance of independence and cooperation.",
      "reversed": "Reversed, it may point to tension or competing priorities. Patience and communication are key to moving forward. Avoid rushing or forcing outcomes. This card may also indicate burnout or losing motivation in your relationships, urging you to take a step back and reconnect with your purpose. Reflect on what’s blocking your progress and take steps to regain your focus and determination. The reversed Chariot encourages you to find balance between effort and self-care, reminding you that true connection comes from a foundation of clarity and mutual respect. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "The Chariot upright in career suggests success through willpower and focus. Challenges can be overcome through discipline and direction. Stay committed to your goals. This card encourages you to take control of your professional path and steer your career in the direction you want to go. It may also indicate a time of growth and achievement in your career, where your efforts are being recognized and rewarded. Embrace your inner strength and stay committed to your goals, knowing that success comes from a balance of effort and self-control. The Chariot reminds you that while challenges may arise, your determination and focus will lead you to triumph.",
      "reversed": "Reversed, it can signal burnout or losing motivation. Reconnect with your purpose before continuing. Avoid forcing progress without a clear plan. This card may also indicate feeling stuck or lacking direction in your career, urging you to take a step back and reassess your goals. Reflect on what’s blocking your progress and take steps to regain your focus and determination. The reversed Chariot encourages you to find balance between effort and self-care, reminding you that true success comes from a foundation of clarity and inner strength. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "Strength": {
    "general": {
      "upright": "Strength upright represents inner courage, patience, and emotional control. True power comes from calm resilience, not aggression. You have the ability to face challenges with grace and compassion. This card encourages you to trust in your own strength and to approach difficulties with a steady heart. It may also indicate a time of personal growth and self-discovery, where you are learning to harness your inner power and confidence. Embrace your resilience and stay true to your values, knowing that true strength comes from within. The Strength card reminds you that kindness and patience are powerful tools for overcoming obstacles and achieving your goals.",
      "reversed": "Reversed, it can mean self-doubt or loss of confidence. Reconnect with your strengths and remember your progress so far. Avoid letting fear or frustration take over. This card may also indicate burnout or emotional imbalance, urging you to take a step back and prioritize self-care. Reflect on what’s blocking your confidence and take steps to rebuild your inner strength. The reversed Strength encourages you to find balance between effort and self-compassion, reminding you that true power comes from a foundation of patience and resilience. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card suggests patience and understanding in your connections. It encourages empathy and calm communication. True strength is shown through kindness. The Strength card encourages you to approach your relationships with compassion and patience, recognizing that true connection comes from understanding and empathy. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a meaningful way. Embrace the strength that comes from kindness and emotional resilience, knowing that strong relationships thrive on mutual respect and understanding.",
      "reversed": "Reversed, it may indicate tension or emotional imbalance. Practice patience and avoid forcing outcomes. This card may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships. Reflect on what’s blocking your confidence and take steps to rebuild your inner strength. The reversed Strength encourages you to find balance between effort and self-compassion, reminding you that true connection comes from a foundation of patience and resilience."
    },
    "career": {
      "upright": "In career, Strength upright points to persistence and steady effort paying off. You’re leading by example through composure. Stay focused on long-term goals. This card encourages you to trust in your own abilities and to approach your professional challenges with patience and resilience. It may also indicate a time of growth and achievement in your career, where your efforts are being recognized and rewarded. Embrace your inner strength and stay committed to your goals, knowing that true success comes from a foundation of patience and steady effort. The Strength card reminds you that kindness and emotional control are powerful tools for overcoming obstacles and achieving your professional aspirations.",
      "reversed": "Reversed, it warns against burnout or letting frustration take over. Focus on balance and self-care to regain confidence. Avoid forcing progress without patience. This card may also indicate feeling stuck or lacking confidence in your career, urging you to take a step back and reassess your goals. Reflect on what’s blocking your progress and take steps to rebuild your inner strength. The reversed Strength encourages you to find balance between effort and self-compassion, reminding you that true success comes from a foundation of patience and resilience. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "The Hermit": {
    "general": {
      "upright": "The Hermit upright symbolizes introspection and reflection. It’s a time for solitude, self-discovery, and learning from within. This card encourages you to seek wisdom through quiet contemplation and to trust your inner guidance. It may also indicate a period of personal growth and spiritual development, where you are learning to connect with your deeper self. Embrace the solitude and use it as an opportunity to gain clarity and insight into your path. The Hermit reminds you that sometimes the answers you seek are found within, and that taking time for yourself can lead to greater understanding and fulfillment.",
      "reversed": "Reversed, it can suggest isolation or feeling disconnected. Reaching out for perspective can help you find clarity again. Avoid withdrawing too much or ignoring your needs. This card may also indicate a reluctance to face inner truths or a fear of solitude, urging you to embrace self-reflection and personal growth. Reflect on what’s blocking your connection to your inner wisdom and take steps to reconnect with yourself. The reversed Hermit encourages you to find balance between solitude and social connection, reminding you that true understanding comes from both introspection and engagement with the world around you."
    },
    "love": {
      "upright": "This card indicates thoughtful reflection in relationships and emotional growth. It may also suggest taking space to understand your needs. Balance solitude with connection. The Hermit encourages you to approach your relationships with introspection and self-awareness, recognizing that true connection comes from understanding yourself first. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a meaningful way. Embrace the strength that comes from self-knowledge and emotional clarity, knowing that strong relationships thrive on mutual respect and understanding.",
      "reversed": "Reversed, it can show loneliness or emotional distance. Balance introspection with openness to connection. The reversed Hermit urges you to reach out and connect with others, reminding you that you don’t have to navigate your feelings alone. Avoid withdrawing too much or ignoring your needs. Reflect on what’s blocking your connection to your inner wisdom and take steps to reconnect with yourself. It may also suggest a reluctance to face inner truths or a fear of solitude, urging you to embrace self-reflection and personal growth. Be honest about your feelings and communicate openly to rebuild trust and understanding in your relationships."
    },
    "career": {
      "upright": "The Hermit upright favors independent work, study, and mentorship. It’s about gaining wisdom before acting. Patience and reflection lead to clarity. This card encourages you to seek knowledge and understanding in your professional life, recognizing that true success comes from a foundation of wisdom and self-awareness. It may also indicate a time of personal growth and development in your career, where you are learning to connect with your deeper purpose. Embrace the solitude and use it as an opportunity to gain clarity and insight into your professional path. The Hermit reminds you that sometimes the answers you seek are found within, and that taking time for yourself can lead to greater understanding and fulfillment in your work.",
      "reversed": "Reversed, it can suggest feeling lost or detached from your work. Seek guidance and reconnect with purpose. Avoid isolating yourself too much. This card may also indicate a reluctance to face professional challenges or a fear of solitude, urging you to embrace self-reflection and personal growth. Reflect on what’s blocking your connection to your inner wisdom and take steps to reconnect with your career goals. The reversed Hermit encourages you to find balance between solitude and social connection, reminding you that true understanding comes from both introspection and engagement with the world around you."
    }
  },
  "Wheel of Fortune": {
    "general": {
      "upright": "Wheel of Fortune upright represents cycles, timing, and change. Life moves in phases, and this card signals a positive shift or new chapter. Embrace the flow and stay adaptable to make the most of opportunities. It may also indicate a time of growth and transformation, where you are learning to navigate the ups and downs of life with grace and resilience. Embrace the changes that come your way, knowing that they are part of a larger cycle of growth and evolution. The Wheel of Fortune reminds you that while you cannot control everything, you can choose how you respond to change. Stay open to new possibilities and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it can mean delays or feeling stuck. Patience is needed — every turn of the wheel eventually brings movement again. Avoid resisting change or forcing outcomes. Reflect on what’s blocking your progress and take steps to regain your momentum. The reversed Wheel of Fortune encourages you to find balance between effort and acceptance, reminding you that true growth comes from embracing the natural cycles of life. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card suggests change or new opportunities in connections. Stay flexible and open to growth. Trust timing. The Wheel of Fortune encourages you to embrace the changes that come your way in your relationships, recognizing that they are part of a larger cycle of growth and evolution. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a dynamic way. Embrace the flow and stay adaptable, knowing that strong relationships thrive on flexibility and openness to change. It’s a reminder that true connection comes from embracing the natural cycles of relationships and trusting in the timing of the universe.",
      "reversed": "Reversed, it indicates repeating patterns or poor timing. Reflect on lessons before trying again. Avoid forcing progress or resisting change. The reversed Wheel of Fortune urges you to find balance between effort and acceptance, reminding you that true connection comes from embracing the natural cycles of relationships. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships. Reflect on what’s blocking your progress and take steps to regain your momentum."
    },
    "career": {
      "upright": "In career, this card shows progress and new opportunities. Stay ready for unexpected changes that work in your favor. Adaptability is key. The Wheel of Fortune encourages you to embrace the changes that come your way in your professional life, recognizing that they are part of a larger cycle of growth and evolution. It may also indicate a time of growth and achievement in your career, where your efforts are being recognized and rewarded. Embrace the flow and stay adaptable, knowing that success often comes from being open to new possibilities and trusting in the timing of the universe. It’s a reminder that while you cannot control everything, you can choose how you respond to change.",
      "reversed": "Reversed, it may signal setbacks or bad timing. Adapt and wait for the right moment to act. Avoid resisting change or forcing outcomes. The reversed Wheel of Fortune encourages you to find balance between effort and acceptance, reminding you that true success comes from embracing the natural cycles of your career. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life. Reflect on what’s blocking your progress and take steps to regain your momentum."
    }
  },
  "Justice": {
    "general": {
      "upright": "Justice upright represents fairness, truth, and accountability. Your actions have consequences — this card reminds you to act with integrity. Balance logic and intuition when making decisions. It may also indicate a time of personal growth and self-reflection, where you are learning to take responsibility for your choices and their impact on your life. Embrace honesty and clarity, knowing that true justice comes from a foundation of integrity and fairness. The Justice card reminds you that while you cannot control everything, you can choose to act in alignment with your values and principles. Stay true to yourself and seek balance in all areas of your life.",
      "reversed": "Reversed, it can point to dishonesty or imbalance. Reflect on where accountability or clarity might be missing. Avoid blaming others or ignoring facts. This card may also indicate a reluctance to face the consequences of your actions or a fear of judgment, urging you to embrace honesty and self-reflection. Reflect on what’s blocking your sense of fairness and take steps to restore balance in your life. The reversed Justice encourages you to find alignment between your actions and your values, reminding you that true integrity comes from taking responsibility for your choices. It may also suggest that you are trying to manipulate situations or people in ways that are not productive, leading to unfair outcomes. Letting go of the need for control can open up new paths and opportunities for growth and fairness."
    },
    "love": {
      "upright": "This card represents honesty and fairness in connections. Clear communication helps maintain balance. Respect boundaries. The Justice card encourages you to approach your relationships with integrity and transparency, recognizing that true connection comes from honesty and mutual respect. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a balanced way. Embrace the clarity and fairness that comes from open communication, knowing that strong relationships thrive on trust and accountability. It’s a reminder that true connection comes from being honest and fair with yourself and others.",
      "reversed": "Reversed, it may mean miscommunication or unfair expectations. Reevaluate your approach and ensure both sides feel heard. Avoid blaming or ignoring issues. The reversed Justice encourages you to find alignment between your actions and your values, reminding you that true connection comes from taking responsibility for your choices. It may also suggest that you are trying to manipulate situations or people in ways that are not productive, leading to unfair outcomes. Letting go of the need for control can open up new paths and opportunities for growth in your relationships. Reflect on what’s blocking your sense of fairness and take steps to restore balance and trust."
    },
    "career": {
      "upright": "In career, Justice upright suggests fair treatment and balanced decisions. It’s a time for ethical choices and honest evaluation. Stay true to your principles. This card encourages you to act with integrity and to seek fairness in your professional interactions. It may also indicate a time of growth and achievement in your career, where your efforts are being recognized and rewarded. Embrace honesty and clarity, knowing that true success comes from a foundation of integrity and fairness. The Justice card reminds you that while you cannot control everything, you can choose to act in alignment with your values and principles in your work. Stay true to yourself and seek balance in your professional life.",
      "reversed": "Reversed, it warns of unfairness or bias in the workplace. Document facts and address issues calmly. Avoid ignoring problems or blaming others. This card may also indicate a reluctance to face professional challenges or a fear of judgment, urging you to embrace honesty and self-reflection. Reflect on what’s blocking your sense of fairness in your career and take steps to restore balance. The reversed Justice encourages you to find alignment between your actions and your values, reminding you that true success comes from taking responsibility for your choices. It may also suggest that you are trying to manipulate situations or people in ways that are not productive, leading to unfair outcomes. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "The Hanged Man": {
    "general": {
      "upright": "The Hanged Man upright encourages patience and seeing things from a new perspective. Sometimes progress means pausing to understand rather than forcing movement. Letting go can lead to breakthroughs. It may also indicate a time of personal growth and self-discovery, where you are learning to embrace uncertainty and trust in the process of change. Embrace the pause and use it as an opportunity to gain clarity and insight into your path. The",
      "reversed": "Reversed, it suggests resistance to change or avoidance. Letting go can open paths that effort alone cannot. Avoid forcing progress or clinging to old ways. This card may also indicate a reluctance to face inner truths or a fear of uncertainty, urging you to embrace new perspectives and personal growth. Reflect on what’s blocking your ability to see things differently and take steps to open your mind. The reversed H"
    },
    "love": {
      "upright": "This card can mean reflection and understanding in connections. Step back to gain perspective before deciding. Patience is key. This card encourages you to approach your relationships with introspection and self-awareness, recognizing that true connection comes from understanding yourself first. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a meaningful way. Embrace the strength that comes from self-knowledge and emotional clarity, knowing that strong relationships thrive on mutual respect and understanding. It’s a reminder that sometimes taking a step back can lead to greater insight and harmony.",
      "reversed": "Reversed, it signals stagnation or indecision. Honest discussion can help move things forward. Avoid avoidance or denial of issues. Avoid forcing progress or clinging to old ways. This card may also indicate a reluctance to face inner truths or a fear of uncertainty, urging you to embrace new perspectives and personal growth. Reflect on what’s blocking your ability to see things differently and take steps to open your mind. The reversed Hanged Man invites you to let go of old patterns and embrace the unknown. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, it indicates waiting, learning, or viewing challenges differently. Patience will pay off. Avoid rushing decisions. This card encourages you to take a step back and reassess your professional path, recognizing that sometimes progress comes from pausing and gaining new insights. It may also indicate a time of personal growth and development in your career, where you are learning to embrace uncertainty and trust in the process of change. Embrace the pause and use it as an opportunity to gain clarity and insight into your professional life. The Hanged Man reminds you that sometimes the answers you seek come from seeing things from a different angle, and that letting go of control can lead to new opportunities.",
      "reversed": "Reversed, it can mean missed opportunities or resistance to necessary change. Be open to adaptation. Avoid forcing progress or clinging to old ways. This card may also indicate a reluctance to face professional challenges or a fear of uncertainty, urging you to embrace new perspectives and personal growth. Reflect on what’s blocking your ability to see things differently and take steps to open your mind. The reversed Hanged Man invites you to let go of old patterns and embrace the unknown. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "Death": {
    "general": {
      "upright": "Death upright symbolizes transformation and endings that lead to renewal. It’s not literal — it’s about releasing what no longer serves you to make space for new beginnings. Embrace change as part of growth. This card encourages you to let go of old patterns, beliefs, or situations that are holding you back, and to welcome the opportunities that come with change. It may also indicate a time of personal growth and evolution, where you are learning to navigate transitions with grace and resilience. Embrace the process of transformation, knowing that it is a necessary part of your journey. The Death card reminds you that while endings can be difficult, they often lead to new beginnings and greater fulfillment.",
      "reversed": "Reversed, it can mean resisting change or staying stuck in old patterns. Embrace transition as part of growth. Avoid clinging to the past or fearing the unknown. This card may also indicate a reluctance to face necessary endings or a fear of transformation, urging you to embrace change and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Death card encourages you to find strength in letting go, reminding you that true healing comes from embracing change and trusting in the process of renewal. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card represents emotional renewal or the end of an outdated dynamic. Change brings clarity and growth. Embrace the transformation. In relationships, it may indicate a significant shift or evolution, urging you to let go of old patterns that no longer serve the connection. Embrace the transformation and trust that it will lead to greater clarity and growth. It’s a reminder that sometimes endings are necessary for new beginnings to take root. This card encourages you to approach your relationships with openness and adaptability, recognizing that true connection often requires change and evolution. Embrace the process of transformation, knowing that it is a necessary part of your journey together.",
      "reversed": "Reversed, it can mean clinging to the past or avoiding needed conversations. Letting go allows healing. Embrace the change. Avoid resisting necessary endings. In relationships, it may suggest a reluctance to face difficult truths or a fear of change, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Death card encourages you to find strength in letting go, reminding you that true healing comes from embracing change and trusting in the process of renewal. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, Death upright means transformation — such as moving on from a job or redefining your goals. It’s the start of a new phase. Embrace evolution. This card encourages you to let go of old professional patterns or situations that are no longer serving your growth, and to welcome the opportunities that come with change. It may also indicate a time of personal growth and development in your career, where you are learning to navigate transitions with grace and resilience. Embrace the process of transformation, knowing that it is a necessary part of your professional journey. The Death card reminds you that while endings can be difficult, they often lead to new beginnings and greater fulfillment in your work.",
      "reversed": "Reversed, it may indicate fear of change or resisting new opportunities. Accept evolution as part of success. Avoid clinging to outdated roles. This card may also suggest a reluctance to face necessary endings or a fear of transformation in your career, urging you to embrace change and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Death card encourages you to find strength in letting go, reminding you that true success comes from embracing change and trusting in the process of renewal. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "Temperance": {
    "general": {
      "upright": "Temperance upright represents balance, moderation, and harmony. It’s a reminder to stay patient and find the middle ground. Avoid extremes and seek integration. This card encourages you to approach life with a sense of calm and equilibrium, recognizing that true strength comes from balance and moderation. It may also indicate a time of personal growth and self-discovery, where you are learning to harmonize different aspects of your life. Embrace the practice of patience and self-control, knowing that it will lead to greater clarity and fulfillment. The Temperance card reminds you that while challenges may arise, maintaining balance and perspective will help you navigate them with grace.",
      "reversed": "Reversed, it signals imbalance or extremes. Slow down and realign your priorities. Avoid rushing or forcing outcomes. This card may also indicate burnout or emotional turbulence, urging you to take a step back and prioritize self-care. Reflect on what’s blocking your sense of harmony and take steps to restore balance in your life. The reversed Temperance encourages you to find alignment between your actions and your values, reminding you that true strength comes from maintaining equilibrium and perspective. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card shows balance and cooperation in emotional connections. It encourages patience and understanding. Harmony builds trust. The Temperance card encourages you to approach your relationships with a sense of balance and moderation, recognizing that true connection comes from patience and mutual respect. It may also indicate a time of growth and deepening bonds, where you are learning to support and care for each other in a harmonious way. Embrace the strength that comes from emotional equilibrium, knowing that strong relationships thrive on understanding and cooperation. It’s a reminder that true connection comes from maintaining balance and perspective.",
      "reversed": "Reversed, it may point to tension or emotional extremes. Recenter yourself before responding. Avoid rushing or forcing outcomes. This card may also indicate burnout or emotional turbulence in your relationships, urging you to take a step back and prioritize self-care. Reflect on what’s blocking your sense of harmony and take steps to restore balance. The reversed Temperance encourages you to find alignment between your actions and your values, reminding you that true connection comes from maintaining equilibrium and perspective. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, Temperance upright suggests steady progress and teamwork. A calm approach leads to success. Balance effort with rest. This card encourages you to maintain a sense of balance and moderation in your professional life, recognizing that true success comes from patience and steady effort. It may also indicate a time of personal growth and development in your career, where you are learning to harmonize different aspects of your work. Embrace the practice of patience and self-control, knowing that it will lead to greater clarity and fulfillment in your professional journey. The Temperance card reminds you that while challenges may arise, maintaining balance and perspective will help you navigate them with grace.",
      "reversed": "Reversed, it can mean burnout or conflict from overworking. Restore balance to regain productivity. Avoid rushing or forcing outcomes. This card may also indicate feeling stuck or lacking harmony in your career, urging you to take a step back and prioritize self-care. Reflect on what’s blocking your sense of balance and take steps to restore equilibrium in your professional life. The reversed Temperance encourages you to find alignment between your actions and your values, reminding you that true success comes from maintaining balance and perspective. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "The Devil": {
    "general": {
      "upright": "The Devil upright represents limitations, habits, or attachments that restrict you. It encourages awareness and breaking free from what holds you back. You have the power to reclaim control. This card urges you to confront fears or unhealthy patterns that may be influencing your decisions. Embrace the process of liberation, knowing that true freedom comes from within. The Devil reminds you that while temptations and challenges may arise, you have the strength to overcome them and create a life aligned with your values and desires. Stay mindful of what binds you and take steps to regain your power.",
      "reversed": "Reversed, it symbolizes release and self-liberation. You’re ready to take control and regain balance. Avoid falling back into old patterns. This card may also indicate a time of personal growth and transformation, where you are learning to let go of limiting beliefs or attachments that no longer serve you. Reflect on what’s blocking your sense of freedom and take steps to reclaim your power. The reversed Devil encourages you to find strength in breaking free, reminding you that true liberation comes from embracing your authentic self and trusting in your ability to create positive change. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card can point to dependence or emotional intensity in connections. Stay aware of boundaries and self-respect to maintain balance. The Devil card encourages you to recognize any unhealthy dynamics or patterns in your relationships that may be limiting your growth. It may also indicate a time of personal growth and self-discovery, where you are learning to assert your boundaries and prioritize your well-being. Embrace the process of liberation, knowing that true connection comes from mutual respect and understanding. It’s a reminder that while challenges may arise, you have the strength to overcome them and create relationships aligned with your values and desires. Stay mindful of what binds you and take steps to regain your power.",
      "reversed": "Reversed, it means breaking free from unhealthy patterns and choosing healthier dynamics. Reclaim your power and set clear boundaries. Avoid falling back into old habits. This card may also indicate a time of personal growth and transformation in your relationships, where you are learning to let go of limiting beliefs or attachments that no longer serve you. Reflect on what’s blocking your sense of freedom and take steps to reclaim your power. The reversed Devil encourages you to find strength in breaking free, reminding you that true liberation comes from embracing your authentic self and trusting in your ability to create positive change in your connections. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, it can suggest feeling stuck or overworked. Reflect on whether you’re sacrificing too much for external rewards. Reclaim balance. This card urges you to confront any limiting beliefs or unhealthy work patterns that may be influencing your professional decisions. Embrace the process of liberation, knowing that true success comes from aligning your career with your values and passions. The Devil reminds you that while temptations and challenges may arise in your work life, you have the strength to overcome them and create a career path that brings fulfillment and joy. Stay mindful of what binds you and take steps to regain your power.",
      "reversed": "Reversed, it represents regaining balance and independence at work. Let go of what drains your motivation. Avoid falling back into old patterns. This card may also indicate a time of personal growth and transformation in your career, where you are learning to let go of limiting beliefs or attachments that no longer serve you. Reflect on what’s blocking your sense of freedom and take steps to reclaim your power. The reversed Devil encourages you to find strength in breaking free, reminding you that true success comes from embracing your authentic self and trusting in your ability to create positive change in your professional life. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your career."
    }
  },
  "The Tower": {
    "general": {
      "upright": "The Tower upright signifies sudden change or revelation that shakes existing foundations. Though uncomfortable, it clears the way for truth and renewal. Embrace upheaval as part of growth. This card encourages you to let go of old structures or beliefs that are no longer serving you, and to welcome the opportunities that come with change. It may also indicate a time of personal growth and transformation, where you are learning to navigate unexpected challenges with resilience and adaptability. Embrace the process of upheaval, knowing that it is a necessary part of your journey. The Tower reminds you that while change can be difficult, it often leads to greater clarity and freedom. Stay open to new possibilities and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it shows gradual transformation or resistance to needed change. Accept shifts rather than avoid them. Avoid clinging to old structures. This card may also indicate a reluctance to face necessary upheaval or a fear of change, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Tower encourages you to find strength in embracing change, reminding you that true growth comes from letting go of what no longer serves you. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card may represent major realization or change in how you relate to others. It can bring clarity through disruption. Embrace honesty even if it’s uncomfortable. The Tower card encourages you to confront any illusions or false beliefs in your relationships that may be limiting your growth. It may also indicate a time of personal growth and self-discovery, where you are learning to embrace truth and authenticity in your connections. Embrace the process of upheaval, knowing that it is a necessary part of your journey together. The Tower reminds you that while change can be difficult, it often leads to greater clarity and freedom in your relationships. Stay open to new possibilities and trust that the universe is guiding you towards deeper connection and understanding.",
      "reversed": "Reversed, it indicates slow internal change or avoidance of difficult conversations. Face what needs attention calmly. Avoid ignoring issues. This card may also indicate a reluctance to face necessary upheaval or a fear of change in your relationships, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Tower encourages you to find strength in embracing change, reminding you that true growth comes from letting go of what no longer serves you. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, The Tower upright can mean restructuring, job shifts, or sudden insight. What falls apart makes room for something stronger. Embrace change. This card encourages you to let go of old professional patterns or situations that are no longer serving your growth, and to welcome the opportunities that come with change. It may also indicate a time of personal growth and development in your career, where you are learning to navigate unexpected challenges with resilience and adaptability. Embrace the process of upheaval, knowing that it is a necessary part of your professional journey. The Tower reminds you that while change can be difficult, it often leads to greater clarity and freedom in your work life. Stay open to new possibilities and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it signals controlled change or adapting before crisis hits. Stay flexible and open to new directions. Avoid clinging to outdated roles. This card may also indicate a reluctance to face necessary upheaval or a fear of change in your career, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Tower encourages you to find strength in embracing change, reminding you that true growth comes from letting go of what no longer serves you. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "The Star": {
    "general": {
      "upright": "The Star upright symbolizes hope, inspiration, and healing. It’s about reconnecting with your purpose and believing in the future. Stay optimistic and trust the journey. This card encourages you to embrace your inner light and to share your gifts with the world. It may also indicate a time of personal growth and renewal, where you are learning to trust in yourself and the universe. Embrace the process of healing, knowing that it will lead to greater clarity and fulfillment. The Star reminds you that while challenges may arise, maintaining hope and optimism will help you navigate them with grace. Stay connected to your dreams and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it can mean losing faith or feeling disconnected. Focus on small steps that restore confidence and optimism. Avoid dwelling on setbacks or ignoring your needs. This card may also indicate a time of personal struggle or doubt, urging you to reconnect with your inner light and to trust in the process of healing. Reflect on what’s blocking your sense of hope and take steps to restore your optimism. The reversed Star encourages you to find strength in vulnerability, reminding you that true healing comes from embracing your authentic self and trusting in your ability to create positive change. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card represents renewal and positive communication in connections. Stay open and kind — optimism builds trust. The Star encourages you to express your feelings and share your dreams with your partner, fostering a deeper emotional bond. It may also indicate a time of growth and healing in your relationships, where you are learning to support and care for each other in a hopeful and inspiring way. Embrace the strength that comes from emotional clarity and optimism, knowing that strong relationships thrive on trust and mutual encouragement. It’s a reminder that true connection comes from believing in each other and the future you can create together.",
      "reversed": "Reversed, it may point to discouragement or emotional fatigue. Healing takes time — stay patient with yourself and others. Avoid withdrawing or ignoring relationship needs. This card may also indicate a time of personal struggle or doubt, urging you to reconnect with your inner light and to trust in the process of healing. Reflect on what’s blocking your sense of hope and take steps to restore your optimism. The reversed Star encourages you to find strength in vulnerability, reminding you that true healing comes from embracing your authentic self and trusting in your ability to create positive change. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "career": {
      "upright": "In career, The Star brings creativity, recognition, and renewed motivation. Your efforts are being noticed. Stay inspired and keep reaching for your goals. This card encourages you to embrace your unique talents and to share your vision with others. It may also indicate a time of personal growth and renewal in your professional life, where you are learning to trust in yourself and the universe. Embrace the process of healing, knowing that it will lead to greater clarity and fulfillment in your career. The Star reminds you that while challenges may arise, maintaining hope and optimism will help you navigate them with grace. Stay connected to your professional dreams and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it signals frustration or lack of direction. Reconnect with your goals and remember your progress. Avoid dwelling on setbacks or ignoring your needs. This card may also indicate a time of personal struggle or doubt in your career, urging you to reconnect with your inner light and to trust in the process of healing. Reflect on what’s blocking your sense of hope and take steps to restore your optimism. The reversed Star encourages you to find strength in vulnerability, reminding you that true success comes from embracing your authentic self and trusting in your ability to create positive change in your professional life. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your career."
    }
  },
  "The Moon": {
    "general": {
      "upright": "The Moon upright represents intuition, emotions, and uncertainty. Things may not be as they seem — trust your instincts and question illusions. Embrace the unknown as part of growth. This card encourages you to explore your inner world and to pay attention to your dreams and feelings. It may also indicate a time of personal growth and self-discovery, where you are learning to navigate uncertainty with courage and resilience. Embrace the process of facing your fears, knowing that it will lead to greater clarity and understanding. The Moon reminds you that while the path may be unclear, trusting your intuition will guide you through the darkness. Stay open to new insights and trust that the universe is leading you towards your highest good.",
      "reversed": "Reversed, it shows clarity emerging after confusion. Facing fears brings understanding. Avoid ignoring intuition or avoiding needed reflection. This card may also indicate a time of personal struggle or doubt, urging you to reconnect with your inner wisdom and to trust in the process of self-discovery. Reflect on what’s blocking your ability to see clearly and take steps to regain your insight. The reversed Moon encourages you to find strength in vulnerability, reminding you that true understanding comes from embracing your authentic self and trusting in your ability to navigate uncertainty. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card reflects emotional depth and uncertainty in relationships. Communication helps reveal truth. Trust your feelings. The Moon encourages you to be honest with yourself and your partner about your emotions, fostering deeper understanding and connection. It may also indicate a time of growth and self-discovery in your relationships, where you are learning to navigate emotional complexities with empathy and patience. Embrace the strength that comes from emotional clarity, knowing that strong relationships thrive on trust and open communication. It’s a reminder that while the path may be unclear, trusting your instincts will guide you through emotional challenges.",
      "reversed": "Reversed, it indicates clearing misunderstandings or emotional confusion. Be honest about how you feel. Avoid avoiding tough conversations. This card may also indicate a time of personal struggle or doubt in your relationships, urging you to reconnect with your inner wisdom and to trust in the process of self-discovery. Reflect on what’s blocking your ability to see clearly and take steps to regain your insight. The reversed Moon encourages you to find strength in vulnerability, reminding you that true understanding comes from embracing your authentic self and trusting in your ability to navigate uncertainty in your connections. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, The Moon upright warns against unclear situations or mixed signals. Wait for more information before deciding. Trust your intuition. This card encourages you to pay attention to your instincts and to be cautious in your professional decisions. It may also indicate a time of personal growth and self-discovery in your career, where you are learning to navigate uncertainty with courage and resilience. Embrace the process of facing your fears, knowing that it will lead to greater clarity and understanding in your professional life. The Moon reminds you that while the path may be unclear, trusting your intuition will guide you through challenges at work. Stay open to new insights and trust that the universe is leading you towards your highest good.",
      "reversed": "Reversed, it means confusion lifting and clarity returning. You’ll soon see the reality of your situation. Trust your instincts and be open to new perspectives. Avoid ignoring intuition or avoiding needed reflection. This card may also indicate a time of personal struggle or doubt in your career, urging you to reconnect with your inner wisdom and to trust in the process of self-discovery. Reflect on what’s blocking your ability to see clearly and take steps to regain your insight. The reversed Moon encourages you to find strength in vulnerability, reminding you that true understanding comes from embracing your authentic self and trusting in your ability to navigate uncertainty in your professional life. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your career."
    }
  },
  "The Sun": {
    "general": {
      "upright": "The Sun upright symbolizes success, clarity, and joy. It’s about positivity, growth, and recognizing your own achievements. Embrace optimism and celebrate progress. This card encourages you to shine your light and to share your happiness with others. It may also indicate a time of personal growth and fulfillment, where you are learning to appreciate the beauty in life and to express your authentic self. Embrace the process of joy, knowing that it will lead to greater clarity and satisfaction. The Sun reminds you that while challenges may arise, maintaining a positive outlook will help you navigate them with confidence. Stay connected to your inner light and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it can mean temporary doubt or overshadowed happiness. Focus on gratitude and progress — brighter times are near. Avoid dwelling on setbacks or ignoring your achievements. This card may also indicate a time of personal struggle or uncertainty, urging you to reconnect with your inner light and to trust in the process of growth. Reflect on what’s blocking your sense of joy and take steps to restore your optimism. The reversed Sun encourages you to find strength in positivity, reminding you that true fulfillment comes from embracing your authentic self and trusting in your ability to create positive change. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card represents openness, trust, and emotional fulfillment. It’s a reminder that authenticity strengthens connection. Joy builds bonds. The Sun encourages you to express your true feelings and to celebrate the happiness you share with your partner. It may also indicate a time of growth and deepening bonds in your relationships, where you are learning to support and care for each other in a joyful and authentic way. Embrace the strength that comes from emotional clarity and positivity, knowing that strong relationships thrive on trust and mutual celebration. It’s a reminder that true connection comes from being open and honest with each other.",
      "reversed": "Reversed, it may suggest temporary misunderstandings. Stay optimistic and communicate clearly. Avoid ignoring relationship strengths or focusing on negatives. This card may also indicate a time of personal struggle or uncertainty in your relationships, urging you to reconnect with your inner light and to trust in the process of growth. Reflect on what’s blocking your sense of joy and take steps to restore your optimism. The reversed Sun encourages you to find strength in positivity, reminding you that true fulfillment comes from embracing your authentic self and trusting in your ability to create positive change in your connections. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, The Sun upright brings recognition, confidence, and clear success. You’re reaching a period of achievement. Stay motivated and celebrate milestones. This card encourages you to embrace your unique talents and to share your vision with others. It may also indicate a time of personal growth and fulfillment in your professional life, where you are learning to appreciate your accomplishments and to express your authentic self at work. Embrace the process of joy, knowing that it will lead to greater clarity and satisfaction in your career. The Sun reminds you that while challenges may arise, maintaining a positive outlook will help you navigate them with confidence. Stay connected to your professional dreams and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it can mean minor setbacks or unclear direction. Keep your goals visible and maintain enthusiasm. Avoid dwelling on setbacks or ignoring your achievements. This card may also indicate a time of personal struggle or uncertainty in your career, urging you to reconnect with your inner light and to trust in the process of growth. Reflect on what’s blocking your sense of joy and take steps to restore your optimism. The reversed Sun encourages you to find strength in positivity, reminding you that true success comes from embracing your authentic self and trusting in your ability to create positive change in your professional life. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your career."
    }
  },
  "Judgement": {
    "general": {
      "upright": "Judgement upright represents reflection, renewal, and taking accountability. It’s time to evaluate your journey and make choices that align with growth. Embrace the lessons learned and use them to propel yourself forward with clarity. This card encourages you to listen to your inner voice and to make decisions that honor your true self. It may also indicate a time of personal growth and transformation, where you are learning to embrace change and new beginnings. Embrace the process of self-reflection, knowing that it will lead to greater clarity and purpose. The Judgement card reminds you that while the past may hold important lessons, your future is shaped by the choices you make today. Stay true to your values and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it can mean self-doubt or resisting change. Learn from the past but don’t let it define your next step. Avoid stagnation by embracing growth opportunities. This card may also indicate a reluctance to face necessary self-reflection or a fear of change, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Judgement encourages you to find strength in embracing change, reminding you that true growth comes from letting go of what no longer serves you. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card encourages honest communication and self-awareness in connections. It’s about understanding and moving forward with clarity. Renewal builds trust. The Judgement card encourages you to reflect on your relationships and to make choices that honor your true self and your partner. It may also indicate a time of growth and transformation in your connections, where you are learning to embrace change and new beginnings together. Embrace the process of self-reflection, knowing that it will lead to greater clarity and purpose in your relationships. The Judgement card reminds you that while the past may hold important lessons, your future together is shaped by the choices you make today. Stay true to your values and trust that the universe is guiding you towards deeper connection and understanding.",
      "reversed": "Reversed, it may point to holding onto past issues. Let go of judgment to rebuild trust and progress. Avoid dwelling on past mistakes or ignoring relationship needs. This card may also indicate a reluctance to face necessary self-reflection or a fear of change in your relationships, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Judgement encourages you to find strength in embracing change, reminding you that true growth comes from letting go of what no longer serves you. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, Judgement upright calls for evaluation and improvement. Reflect on your choices and prepare for advancement. Embrace the lessons learned and use them to propel yourself forward with clarity. This card encourages you to listen to your inner voice and to make professional decisions that honor your true self and your goals. It may also indicate a time of personal growth and transformation in your career, where you are learning to embrace change and new opportunities. Embrace the process of self-reflection, knowing that it will lead to greater clarity and purpose in your professional life. The Judgement card reminds you that while the past may hold important lessons, your future is shaped by the choices you make today. Stay true to your values and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it may mean hesitation or fear of taking responsibility. Face challenges with honesty and intention. Avoid stagnation by embracing growth opportunities. This card may also indicate a reluctance to face necessary self-reflection or a fear of change in your career, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to move forward and take steps to release old patterns. The reversed Judgement encourages you to find strength in embracing change, reminding you that true growth comes from letting go of what no longer serves you. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your professional life."
    }
  },
  "The World": {
    "general": {
      "upright": "The World upright symbolizes completion, success, and fulfillment. You’ve reached a milestone and can take pride in your growth and accomplishments. Embrace new beginnings with confidence. This card encourages you to celebrate your achievements and to recognize the progress you’ve made on your journey. It may also indicate a time of personal growth and transformation, where you are learning to embrace new opportunities and challenges with optimism and courage. Embrace the process of completion, knowing that it will lead to greater clarity and purpose. The World reminds you that while one chapter may be ending, a new one is beginning, filled with potential and promise. Stay open to new experiences and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it suggests unfinished goals or feeling incomplete. Reflect on what’s missing and plan your next chapter with intention. Avoid rushing — true fulfillment takes time. This card may also indicate a reluctance to embrace change or a fear of moving forward, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to complete your journey and take steps to release old patterns. The reversed World encourages you to find strength in embracing new beginnings, reminding you that true fulfillment comes from embracing your authentic self and trusting in your ability to create positive change. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
    },
    "love": {
      "upright": "This card shows balance, understanding, and emotional growth in connections. Mutual respect and closure bring harmony. Celebrate your journey together. The World encourages you to appreciate the growth and progress you and your partner have made together. It may also indicate a time of transformation and renewal in your relationships, where you are learning to embrace new opportunities and challenges with optimism and courage. Embrace the process of completion, knowing that it will lead to greater clarity and purpose in your connections. The World reminds you that while one chapter may be ending, a new one is beginning, filled with potential and promise for your relationship. Stay open to new experiences together and trust that the universe is guiding you towards deeper connection and understanding.",
      "reversed": "Reversed, it may indicate distance or lack of resolution. Communication and reflection can help close the gap. Avoid rushing — true fulfillment takes time. This card may also indicate a reluctance to embrace change or a fear of moving forward in your relationships, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to complete your journey together and take steps to release old patterns. The reversed World encourages you to find strength in embracing new beginnings, reminding you that true fulfillment comes from embracing your authentic self and trusting in your ability to create positive change in your connections. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your relationships."
    },
    "career": {
      "upright": "In career, The World upright marks completion or recognition of hard work. You’re achieving long-term goals or reaching a new level of mastery. Embrace new challenges with confidence. This card encourages you to celebrate your professional achievements and to recognize the progress you’ve made on your career journey. It may also indicate a time of personal growth and transformation in your professional life, where you are learning to embrace new opportunities and challenges with optimism and courage. Embrace the process of completion, knowing that it will lead to greater clarity and purpose in your career. The World reminds you that while one chapter may be ending, a new one is beginning, filled with potential and promise for your professional growth. Stay open to new experiences and trust that the universe is guiding you towards your highest good.",
      "reversed": "Reversed, it can mean delays or feeling stuck before success. Stay consistent — the finish line is near. Avoid rushing — true fulfillment takes time. This card may also indicate a reluctance to embrace change or a fear of moving forward in your career, urging you to embrace transformation and personal growth. Reflect on what’s blocking your ability to complete your professional journey and take steps to release old patterns. The reversed World encourages you to find strength in embracing new beginnings, reminding you that true fulfillment comes from embracing your authentic self and trusting in your ability to create positive change in your professional life. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth in your career."
    }
  }
}
