{
  "Ace of Wands": {
  "general": {
    "upright": "The Ace of Wands upright signals the start of a new creative journey. It represents inspiration, growth, and the spark of new opportunities. This card encourages you to embrace your potential and take action on your ideas. Now is the time to pursue your passions and trust in your ability to create something meaningful.",
    "reversed": "The Ace of Wands reversed warns of delays, creative blocks, or lack of energy. You may feel uninspired or struggle to get started. Take time to reconnect with your motivation and address any obstacles before moving forward. This card suggests patience and reflection before launching new projects."
  },
  "love": {
    "upright": "In love, the Ace of Wands upright points to a passionate new relationship or a burst of creative energy in an existing one. It’s a time for excitement, inspiration, and open expression. Embrace new experiences and let your enthusiasm guide you.",
    "reversed": "Reversed, this card suggests a lack of passion or creative blocks in your relationship. There may be delays or misunderstandings. Take time to communicate and reignite the spark, or reflect on what’s holding you back from deeper connection."
  },
  "career": {
    "upright": "Career-wise, the Ace of Wands upright brings new opportunities, creative projects, and the potential for growth. It’s a call to take initiative and pursue your ambitions. Trust your ideas and be proactive in seeking out new challenges.",
    "reversed": "Reversed, this card warns of missed opportunities, lack of motivation, or creative blocks at work. You may feel stuck or uninspired. Reflect on your goals and consider what changes are needed to move forward."
  }
},
  "2 of Wands": {
    "general": {
      "upright": "The 2 of Wands upright signifies planning for the future, making decisions, and stepping out of your comfort zone. It represents personal power and the ability to shape your own destiny. This card encourages you to take control and explore new possibilities with confidence. It’s a time for bold choices and visionary thinking. Embrace the adventure ahead.",
      "reversed": "Reversed, the 2 of Wands indicates a fear of the unknown, lack of planning, and poor decision-making. You may be hesitant to leave your comfort zone and explore new possibilities. This card suggests the need to overcome self-doubt and take proactive steps toward your goals. Patience and careful planning are essential before moving forward."
    },
    "love": {
      "upright": "In love, the 2 of Wands upright suggests planning a future together, taking control of the relationship, and embracing new experiences. It's a time for growth and exploration. This card encourages open communication about your shared goals. It’s a moment to envision the path ahead with optimism and confidence.",
      "reversed": "Reversed, this card points to a lack of commitment, poor relationship planning, and fear of the future. You may be avoiding important conversations about where the relationship is headed. It's time to address these issues and make clear decisions about your romantic path."
    },
    "career": {
      "upright": "In career, the 2 of Wands upright signifies planning for expansion, exploring new partnerships, and taking control of your professional path. It's a time for visionary thinking and bold decisions. This card encourages you to step out of your comfort zone and pursue new opportunities with confidence. Embrace the adventure ahead.",
      "reversed": "Reversed, this card indicates a lack of career direction, poor planning, and missed opportunities. You may be hesitant to take risks or explore new professional avenues. Reflect on your goals and consider what changes are needed to move forward effectively. Patience and careful planning are essential before making big career moves."
    }
  },
  "3 of Wands": {
    "general": {
      "upright": "The 3 of Wands upright signifies expansion, foresight, and the exploration of new opportunities. It encourages you to think big and plan for the future. This card represents the potential for growth and the rewards of your efforts. Embrace the journey ahead with optimism and confidence. It's a time to take calculated risks and trust in your vision.",
      "reversed": "Reversed, the 3 of Wands indicates delays, lack of foresight, and missed opportunities. You may be feeling stuck or uncertain about your next steps. This card suggests the need to reassess your plans and be patient as you navigate obstacles. Focus on building a solid foundation before moving forward. Avoid rushing into new ventures without proper preparation."
    },
    "love": {
      "upright": "In love, the 3 of Wands upright signifies long-distance love, expansion in the relationship, and future planning. It encourages you to think about the bigger picture and the potential for growth together. This card suggests optimism and excitement about what lies ahead. Embrace new experiences and opportunities for connection.",
      "reversed": "Reversed, the 3 of Wands points to relationship delays, lack of progress, and playing it safe. You may be avoiding important conversations about the future or feeling uncertain about the direction of the relationship. It's time to address these issues and make clear decisions about your romantic path. Avoid rushing into new ventures without proper preparation."
    },
    "career": {
      "upright": "In career, the 3 of Wands upright signifies career expansion, overseas opportunities, leadership, and progress. It's a time to think about your long-term goals and the steps needed to achieve them. This card encourages you to take calculated risks and trust in your vision. Embrace new professional opportunities with confidence.",
      "reversed": "Reversed, the 3 of Wands indicates career delays, lack of progress, and missed opportunities abroad. You may be feeling stuck or uncertain about your next steps. This card suggests the need to reassess your plans and be patient as you navigate obstacles. Focus on building a solid foundation before moving forward. Avoid rushing into new ventures without proper preparation."
    }
  },
  "4 of Wands": {
    "general": {
      "upright": "The 4 of Wands upright represents celebration, harmony, and community. It signifies a time of joy, stability, and the successful completion of a project or phase in life. This card encourages you to embrace the positive energy around you and share your happiness with others. It's a moment to appreciate your achievements and the support of your loved ones.",
      "reversed": "Reversed, the 4 of Wands indicates instability, lack of harmony, and delays in celebration. You may be feeling disconnected from your community or experiencing challenges in your personal life. This card suggests the need to address any underlying issues and work towards restoring balance and joy. Focus on building a strong foundation before celebrating your successes."
    },
    "love": {
      "upright": "In love, the 4 of Wands upright signifies relationship celebration, harmony, and stability. It represents a joyful union, engagement, or marriage. This card encourages you to embrace the positive energy in your relationship and share your happiness with your partner. It's a time to appreciate your love and the support of your loved ones.",
      "reversed": "Reversed, the 4 of Wands indicates relationship problems, family disapproval, and delayed commitment. You may be feeling disconnected from your partner or facing challenges in your romantic life. This card suggests the need to address any underlying issues and work towards restoring harmony and understanding."
    },
    "career": {
      "upright": "In career, the 4 of Wands upright signifies work celebration, team harmony, project completion, and a sense of community in the workplace. It's a time to appreciate your colleagues and the support you receive from your professional network. Embrace the positive energy and celebrate your achievements together.",
      "reversed": "Reversed, the 4 of Wands indicates workplace conflicts, lack of recognition, and project delays. You may be feeling undervalued or facing challenges in your professional relationships. This card suggests the need to address any issues and work towards restoring balance and collaboration. Focus on building a strong foundation before celebrating your successes."
    }
  },
  "5 of Wands": {
    "general": {
      "upright": "The 5 of Wands upright represents conflict, competition, and challenges. It signifies a time of struggle and the need to assert yourself in the face of opposition. This card encourages you to embrace healthy competition and use it as an opportunity for growth. It's a reminder that challenges can lead to personal development and stronger relationships when approached with a positive mindset.",
      "reversed": "Reversed, the 5 of Wands indicates inner conflict, avoidance of conflict, and a desire for peace. You may be feeling overwhelmed by competition or struggling to find common ground with others. This card suggests the need to address any underlying issues and work towards resolution and harmony."
    },
    "love": {
      "upright": "In love, the 5 of Wands upright signifies relationship arguments, competition, and tension. It represents a time of struggle and the need to assert your needs and desires. This card encourages you to communicate openly with your partner and work through any conflicts together. It's a reminder that challenges can lead to stronger relationships when approached with understanding and respect.",
      "reversed": "Reversed, the 5 of Wands indicates resolving conflicts, avoiding arguments, and finding peace in your relationship. You may be feeling more harmonious with your partner and willing to compromise. This card suggests the need to focus on collaboration and understanding. It's a time to let go of competition and embrace unity."
    },
    "career": {
      "upright": "In career, the 5 of Wands upright signifies workplace competition, conflicts, disagreements, and tension. It represents a time of struggle and the need to assert your ideas and opinions. This card encourages you to embrace healthy competition and use it as an opportunity for growth. It's a reminder that challenges can lead to personal development and stronger professional relationships when approached with a positive mindset.",
      "reversed": "Reversed, the 5 of Wands indicates avoiding workplace conflict, fostering teamwork, and seeking resolution. You may be feeling more collaborative with your colleagues and willing to compromise. This card suggests the need to focus on harmony and understanding in your professional relationships. It's a time to let go of competition and embrace unity."
    }
  },
  "6 of Wands": {
    "general": {
      "upright": "The 6 of Wands upright signifies victory, success, and public recognition. It represents a time of achievement and the acknowledgment of your efforts. This card encourages you to celebrate your accomplishments and share your success with others. It's a reminder that your hard work has paid off, and you are being recognized for your talents and contributions.",
      "reversed": "Reversed, the 6 of Wands indicates lack of recognition, self-doubt, and private achievement. You may be feeling overlooked or undervalued despite your efforts. This card suggests the need to focus on your inner confidence and self-worth rather than seeking external validation. Remember that true success comes from within, and your achievements are meaningful even if they go unnoticed by others."
    },
    "love": {
      "upright": "In love, the 6 of Wands upright signifies relationship success, public recognition, and confidence in love. It represents a time of celebration and joy in your romantic life. This card encourages you to embrace your achievements as a couple and share your happiness with others. It's a reminder that your relationship is strong and worthy of recognition.",
      "reversed": "Reversed, the 6 of Wands indicates private relationship success, self-doubt, and lack of support. You may be feeling insecure in your relationship or struggling to find validation from your partner. This card suggests the need to focus on your own self-worth and communicate openly with your partner about your feelings. Remember that true confidence in love comes from within, and your relationship is valuable even if it goes unnoticed by others."
    },
    "career": {
      "upright": "In career, the 6 of Wands upright signifies career success, promotion, recognition, leadership, and victory. It represents a time of achievement and the acknowledgment of your efforts in the workplace. This card encourages you to celebrate your accomplishments and share your success with colleagues. It's a reminder that your hard work has paid off, and you are being recognized for your talents and contributions.",
      "reversed": "Reversed, the 6 of Wands indicates lack of recognition, self-doubt, and private achievement. You may be feeling overlooked or undervalued despite your efforts. This card suggests the need to focus on your inner confidence and self-worth rather than seeking external validation. Remember that true success comes from within, and your achievements are meaningful even if they go unnoticed by others."
    }
  },
  "7 of Wands": {
    "general": {
      "upright": "In terms of general meaning, the 7 of Wands upright represents standing your ground, defending your position, and facing challenges with courage. It signifies a time of perseverance and the need to assert yourself in the face of opposition. This card encourages you to embrace your inner strength and confidence as you navigate obstacles. It's a reminder that you have the power to overcome difficulties and protect what is important to you.",
      "reversed": "Reversed, the 7 of Wands indicates feeling overwhelmed, giving up, and surrendering your position. You may be struggling to maintain your stance or facing challenges that seem insurmountable. This card suggests the need to reassess your approach and consider whether it's worth continuing the fight. Remember that sometimes, letting go can lead to new opportunities and growth."
    },
    "love": {
      "upright": "In love, the 7 of Wands upright signifies defending your relationship, standing up for your needs, and facing challenges together. It represents a time of perseverance and the need to assert yourself in your romantic life. This card encourages you to communicate openly with your partner and work through any conflicts with confidence. It's a reminder that strong relationships can withstand challenges when both partners are committed to growth.",
      "reversed": "Reversed, the 7 of Wands indicates giving up on the relationship, feeling overwhelmed, and surrendering your position. You may be struggling to maintain your stance or facing challenges that seem insurmountable. This card suggests the need to reassess your approach and consider whether it's worth continuing the fight. Remember that sometimes, letting go can lead to new opportunities and growth."
    },
    "career": {
      "upright": "In career, the 7 of Wands upright signifies defending your position, facing workplace challenges, and standing your ground. It represents a time of perseverance and the need to assert yourself in your professional life. This card encourages you to embrace your inner strength and confidence as you navigate obstacles at work. It's a reminder that you have the power to overcome difficulties and protect your career goals.",
      "reversed": "Reversed, the 7 of Wands indicates giving up the career fight, feeling overwhelmed, and lacking confidence. You may be struggling to maintain your position or facing challenges that seem insurmountable. This card suggests the need to reassess your approach and consider whether it's worth continuing the fight. Remember that sometimes, letting go can lead to new opportunities and growth."
    }
  },
  "8 of Wands": {
    "general": {
      "upright": "In terms of general meaning, the 8 of Wands upright represents rapid action, movement, quick decisions, news, and travel. It signifies a time of swift progress and the need to embrace change. This card encourages you to be open to new opportunities and to act quickly when they arise. It's a reminder that momentum is on your side, and you have the ability to make things happen rapidly.",
      "reversed": "Reversed, the 8 of Wands indicates delays, frustration, resisting change, and a lack of internal alignment. You may be feeling stuck or unable to move forward. This card suggests the need to reassess your goals and priorities, and to find ways to regain momentum. Patience and flexibility are key during this time."
    },
    "love": {
      "upright": "In love, the 8 of Wands upright signifies a fast-moving relationship, quick decisions, and exciting news. It represents a time of passion and the need to embrace change within your romantic life. This card encourages you to be open to new experiences and to communicate openly with your partner. It's a reminder that momentum is on your side, and positive developments are likely to occur rapidly.",
      "reversed": "Reversed, the 8 of Wands indicates relationship delays, slow progress, and miscommunication. You may be feeling stuck or unable to move forward in your love life. This card suggests the need to reassess your approach and find ways to improve communication with your partner. Patience and understanding are essential during this time."
    },
    "career": {
      "upright": "In career, the 8 of Wands upright signifies fast career progress, quick decisions, and travel for work. It represents a time of swift movement and the need to seize opportunities as they arise. This card encourages you to be adaptable and open to change in your professional life. It's a reminder that momentum is on your side, and you have the ability to make significant strides in your career.",
      "reversed": "Reversed, the 8 of Wands indicates career delays, slow progress, frustration, and missed opportunities. You may be feeling stuck or unable to move forward in your career. This card suggests the need to reassess your goals and find ways to regain momentum. Patience and flexibility are key during this time."
    }
  },
  "9 of Wands": {
    "general": {
      "upright": "The 9 of Wands upright represents resilience, courage, and persistence in the face of challenges. It signifies a test of faith and the need to maintain boundaries. This card encourages you to draw upon your inner strength and to keep going, even when the going gets tough. It's a reminder that you have the endurance to overcome obstacles and that victory is within reach if you stay committed to your path.",
      "reversed": "Reversed, the 9 of Wands indicates feeling overwhelmed, defensive, and paranoid. You may be struggling to maintain your boundaries or feeling like giving up. This card suggests the need to reassess your situation and find ways to restore your energy and confidence. Focus on self-care and seek support from others if needed. Remember that resilience comes from within, and you have the strength to overcome challenges."
    },
    "love": {
      "upright": "In love, the 9 of Wands upright signifies resilience and the ability to overcome challenges within a relationship. It represents a time of persistence and the need to maintain healthy boundaries with your partner. This card encourages you to draw upon your inner strength and to keep going, even when faced with difficulties. It's a reminder that love requires effort and commitment, and that you have the endurance to weather any storm.",
      "reversed": "Reversed, the 9 of Wands indicates struggles within a relationship, feeling defensive, and potential trust issues. You may be feeling overwhelmed by challenges or unsure of your partner's intentions. This card suggests the need to reassess your relationship dynamics and to find ways to restore trust and open communication. Focus on self-care and seek support from others if needed. Remember that resilience comes from within, and you have the strength to overcome relationship challenges."
    },
    "career": {
      "upright": "In career, the 9 of Wands upright signifies persistence and resilience in overcoming work challenges. It represents a time of determination and the need to maintain boundaries with colleagues. This card encourages you to draw upon your inner strength and to keep pushing forward, even when faced with obstacles. It's a reminder that success requires effort and commitment, and that you have the endurance to achieve your goals.",
      "reversed": "Reversed, the 9 of Wands indicates feelings of burnout, defensiveness, and paranoia in the workplace. You may be struggling to maintain your boundaries or feeling overwhelmed by challenges. This card suggests the need to reassess your work situation and to find ways to restore your energy and confidence. Focus on self-care and seek support from others if needed. Remember that resilience comes from within, and you have the strength to overcome career challenges."
    }
  },
  "10 of Wands": {
    "general": {
      "upright": "Generally speaking, the 10 of Wands upright represents burden, responsibility, and hard work. It signifies a time of completion and the need to manage your load effectively. This card encourages you to recognize when you are taking on too much and to find ways to delegate or lighten your responsibilities. It's a reminder that while hard work is necessary, it's also important to maintain balance and avoid burnout.",
      "reversed": "Reversed, the 10 of Wands indicates a release of burdens and the need to let go of responsibilities that are no longer serving you. It suggests a time of delegation and finding ways to lighten your load. This card encourages you to seek support from others and to prioritize self-care. Remember that it's okay to ask for help and to take a step back when needed. Balance is key to maintaining your well-being."
    },
    "love": {
      "upright": "In love, the 10 of Wands upright signifies taking on too much responsibility within a relationship. It represents a time of hard work and the need to communicate openly with your partner about your needs. This card encourages you to find ways to share the load and to avoid becoming overwhelmed by relationship pressures. It's a reminder that a healthy relationship requires balance and mutual support.",
      "reversed": "Reversed, the 10 of Wands indicates a release of relationship burdens and the need to share responsibilities with your partner. It suggests a time of healing and finding balance within the relationship. This card encourages open communication and a willingness to let go of past grievances. Remember that a strong relationship is built on mutual support and understanding."
    },
    "career": {
      "upright": "In career, the 10 of Wands upright signifies work overload, extra responsibilities, and the need to complete tasks. It represents a time of hard work and the importance of managing your workload effectively. This card encourages you to recognize when you are taking on too much and to find ways to delegate or lighten your responsibilities. It's a reminder that while hard work is necessary, it's also important to maintain balance and avoid burnout.",
      "reversed": "Reversed, the 10 of Wands indicates a need to delegate work, reduce your workload, and let go of responsibilities that are no longer serving you. It suggests a time of finding balance and prioritizing self-care. This card encourages you to seek support from others and to remember that it's okay to ask for help when needed. Balance is key to maintaining your well-being and career success."
    }
  },
  "Page of Wands": {
    "general": {
      "upright": "Here, the Page of Wands upright represents enthusiasm, exploration, and a fresh perspective. It signifies a time of new beginnings and the need to embrace your adventurous spirit. This card encourages you to be open to new experiences and to approach life with curiosity and optimism. It's a reminder that growth comes from stepping outside your comfort zone and being willing to take risks. Embrace your inner explorer and let your passion guide you.",
      "reversed": "Lack of direction, no follow through, disappointing news, delays. You may be feeling uncertain about your path or struggling to find motivation. This card suggests the need to reassess your goals and to find ways to reignite your passion. Focus on setting clear intentions and taking small steps toward your aspirations. Remember that enthusiasm can be cultivated through action and exploration."
    },
    "love": {
      "upright": "The Page of Wands upright signifies new romantic opportunities, excitement, and adventurous love. It represents a time of exploration and the need to embrace your passionate side. This card encourages you to be open to new experiences and to approach love with curiosity and optimism. It's a reminder that growth in relationships comes from stepping outside your comfort zone and being willing to take risks. Embrace your inner explorer and let your heart guide you.",
      "reversed": "Reversed, the Page of Wands indicates a lack of direction in love, mixed signals, and disappointing news. You may be feeling uncertain about your romantic path or struggling to find motivation in your relationships. This card suggests the need to reassess your feelings and to find ways to reignite your passion. Focus on setting clear intentions and taking small steps toward your romantic aspirations. Remember that enthusiasm in love can be cultivated through action and exploration."
    },
    "career": {
      "upright": "The Page of Wands upright signifies career inspiration, new ideas, and creative opportunities. It represents a time of exploration and the need to embrace your innovative side. This card encourages you to be open to new possibilities and to approach your work with curiosity and enthusiasm. It's a reminder that growth in your career comes from taking risks and being willing to step outside your comfort zone.",
      "reversed": "Reversed, the Page of Wands indicates a lack of career direction, disappointing work news, and missed opportunities. You may be feeling uncertain about your professional path or struggling to find motivation in your work. This card suggests the need to reassess your goals and to find ways to reignite your passion for your career. Focus on setting clear intentions and taking small steps toward your professional aspirations."
    }
  },
  "Knight of Wands": {
    "general": {
      "upright": "The Knight of Wands upright signifies action, impulsiveness, adventure, and high energy. It represents a time of pursuing your passions and embracing new experiences with enthusiasm. This card encourages you to be bold and to take risks in order to achieve your goals. It's a reminder that sometimes you need to act quickly and decisively in order to seize opportunities.",
      "reversed": "Reversed, the Knight of Wands indicates passivity, recklessness, a lack of energy, and no clear direction. You may be feeling stuck or unsure about your next steps. This card suggests the need to reassess your goals and to find ways to reignite your passion. Focus on taking small, deliberate actions rather than rushing into things without a plan."
    },
    "love": {
      "upright": "The Knight of Wands upright signifies a passionate lover, adventure in love, and impulsive romance. It represents a time of excitement and the need to embrace your desires. This card encourages you to be open to new experiences and to approach love with enthusiasm and confidence. It's a reminder that sometimes you need to take bold actions in order to pursue your romantic interests.",
      "reversed": "Reversed, the Knight of Wands indicates recklessness in love, a lack of commitment, and impulsive decisions. You may be feeling uncertain about your romantic path or struggling to find stability in your relationships. This card suggests the need to reassess your feelings and to find ways to cultivate deeper connections. Focus on building a solid foundation rather than rushing into things without a plan."
    },
    "career": {
      "upright": "The Knight of Wands upright signifies taking action at work, career adventure, and an energetic approach. It represents a time of pursuing your professional passions and embracing new opportunities with enthusiasm. This card encourages you to be bold and to take risks in your career. It's a reminder that sometimes you need to act quickly and decisively in order to seize opportunities and advance your career.",
      "reversed": "Reversed, the Knight of Wands indicates reckless career decisions, a lack of direction, and impulsive actions. You may be feeling uncertain about your professional path or struggling to find motivation in your work. This card suggests the need to reassess your goals and to find ways to reignite your passion for your career. Focus on taking small, deliberate actions rather than rushing into things without a plan." 
    }
  },
  "Queen of Wands": {
    "general": {
      "upright": "Upright Queen of Wands manifests as confidence, independence, and determination. She embodies warmth, vibrancy, and a strong sense of self. This card encourages you to embrace your inner strength and to pursue your goals with passion and enthusiasm. It's a reminder that you have the power to create your own destiny and to inspire others along the way. Embrace your creativity and let your light shine.",
      "reversed": "Reversed, the Queen of Wands indicates insecurity, jealousy, and a lack of confidence. You may be feeling uncertain about your abilities or struggling to assert yourself. This card suggests the need to focus on building your self-esteem and finding ways to cultivate inner strength. Avoid comparing yourself to others and remember that your unique qualities are what make you special. Embrace your creativity and let your light shine from within."
    },
    "love": {
      "upright": "Here, the Queen of Wands upright signifies a confident and passionate partner. She represents warmth, independence, and a strong sense of self in relationships. This card encourages you to embrace your inner strength and to pursue love with enthusiasm and confidence. It's a reminder that you have the power to create a fulfilling romantic life and to inspire your partner along the way. Embrace your creativity and let your love shine.",
      "reversed": "Reversed, the Queen of Wands indicates jealousy, insecurity, and a lack of confidence in love. You may be feeling uncertain about your romantic path or struggling to assert yourself in relationships. This card suggests the need to focus on building your self-esteem and finding ways to cultivate inner strength. Avoid comparing yourself to others and remember that your unique qualities are what make you special. Embrace your creativity and let your love shine from within."
    },
    "career": {
      "upright": "This card signifies a confident and capable professional. You are likely to take the lead in your career and inspire others with your vision and determination. Embrace your entrepreneurial spirit and pursue your goals with passion. This is a time for taking bold actions and making significant progress in your professional life. Trust in your abilities and let your creativity guide you. You have the power to create your own success and make a positive impact in your field.",
      "reversed": "Reversed, the Queen of Wands indicates a lack of work confidence, workplace jealousy, and insecurity. You may be feeling uncertain about your abilities or struggling to assert yourself in your career. This card suggests the need to focus on building your self-esteem and finding ways to cultivate inner strength. Avoid comparing yourself to others and remember that your unique qualities are what make you special. Embrace your creativity and let your professional light shine from within."
    }
  },
  "King of Wands": {
    "general": {
      "upright": "The King of Wands upright represents leadership, vision, and entrepreneurship. He embodies confidence, charisma, and a strong sense of purpose. This card encourages you to embrace your inner strength and to pursue your goals with passion and determination. It's a reminder that you have the power to create your own destiny and to inspire others along the way. Embrace your creativity and let your light shine. You are a natural leader, capable of guiding others toward success.",
      "reversed": "Reversed, the King of Wands indicates impulsiveness, overbearing behavior, and unachievable expectations. You may be feeling frustrated with your current situation or struggling to assert your vision. This card suggests the need to focus on finding balance and avoiding extremes. Remember that true leadership comes from inspiring others, not from dominating them. Seek guidance if needed to realign your goals and find your path forward."
    },
    "love": {
      "upright": "In love, the King of Wands upright signifies a passionate and charismatic partner. He represents confidence, leadership, and a strong sense of purpose in relationships. This card encourages you to embrace your inner strength and to pursue love with enthusiasm and determination. It's a reminder that you have the power to create a fulfilling romantic life and to inspire your partner along the way. Embrace your creativity and let your love shine.",
      "reversed": "Reversed, the King of Wands indicates a controlling partner, unrealistic expectations, and impulsive behavior. You may be feeling frustrated with your current relationship or struggling to assert your needs. This card suggests the need to focus on finding balance and avoiding extremes. Remember that true love comes from mutual respect and understanding, not from domination. Seek guidance if needed to realign your romantic goals."
    },
    "career": {
      "upright": "In a career context, the King of Wands upright signifies a strong leader and visionary. You are likely to take charge of your professional life and inspire others with your ideas and determination. This card encourages you to embrace your entrepreneurial spirit and to pursue your goals with passion. It's a reminder that you have the power to create your own success and to make a positive impact in your field. Trust in your abilities and let your creativity guide you.",
      "reversed": "Reversed, the King of Wands indicates poor leadership, unrealistic goals, and a lack of direction. You may be feeling frustrated with your current career path or struggling to assert your vision. This card suggests the need to focus on finding balance and avoiding extremes. Remember that true success comes from inspiring others, not from dominating them. Seek guidance if needed to realign your professional goals."
    }
  },
  "Ace of Cups": {
    "general": {
      "upright": "This card signifies new beginnings in love, emotional fulfillment, and spiritual growth. It represents the potential for deep emotional connections and the start of a new chapter in your emotional life. This card encourages you to open your heart to new experiences and to embrace the flow of emotions. It's a reminder that love and compassion are powerful forces that can lead to personal transformation. Embrace the opportunities for emotional growth and connection that come your way.",
      "reversed": "Reversed, the Ace of Cups indicates blocked or repressed emotions, missed opportunities for love, and emotional exhaustion. You may be feeling disconnected from your feelings or struggling to open your heart to new experiences. This card suggests the need to reassess your emotional state and to find ways to heal and nurture yourself. Focus on self-care and seek support from others if needed. Remember that emotional growth comes from within, and you have the power to create meaningful connections when you are ready."
    },
    "love": {
      "upright": "Here, the Ace of Cups signifies the beginning of a new romantic relationship or a deepening of emotional connections. It represents the potential for love, joy, and emotional fulfillment. This card encourages you to open your heart and embrace the possibilities that come your way. It's a reminder that love is a powerful force that can lead to personal transformation and happiness. Embrace new experiences and opportunities for connection.",
      "reversed": "Reversed, the Ace of Cups indicates blocked or repressed emotions, missed opportunities for love, and emotional exhaustion. You may be feeling disconnected from your feelings or struggling to open your heart to new experiences. This card suggests the need to reassess your emotional state and to find ways to heal and nurture yourself. Focus on self-care and seek support from others if needed. Remember that emotional growth comes from within, and you have the power to create meaningful connections when you are ready."
    },
    "career": {
      "upright": "The Ace of Cups upright signifies new beginnings in your career, emotional fulfillment at work, and creative opportunities. It represents the potential for deep satisfaction and joy in your professional life. This card encourages you to embrace new projects and collaborations that align with your passions. It's a reminder that when you follow your heart, you can find true fulfillment in your work.",
      "reversed": "Reversed, the Ace of Cups indicates a lack of motivation, emotional burnout, and unfulfilling work. You may be feeling disconnected from your passions or struggling to find joy in your professional life. This card suggests the need to reassess your career goals and to seek out opportunities that align with your true self. Focus on self-care and consider seeking support from others if needed."
    }
  },
  "2 of Cups": {
    "general": {
      "upright": "The 2 of Cups upright signifies a strong connection and partnership between two individuals. It represents mutual respect, love, and understanding. This card encourages you to embrace your relationships and to nurture the bonds you share with others. It's a reminder that true love and connection come from open communication and emotional honesty. Embrace the harmony and balance that this card represents, and cherish the meaningful connections in your life.",
      "reversed": "Reversed, the 2 of Cups indicates self-love, break-ups, disharmony, distrust, and imbalance. You may be feeling disconnected from your partner or struggling to find common ground. This card suggests the need to focus on healing and nurturing yourself before seeking connection with others. It's a reminder that healthy relationships start with a strong foundation of self-love and respect."
    },
    "love": {
      "upright": "In love, the 2 of Cups upright signifies a deep romantic connection, mutual attraction, and harmonious partnership. It represents a time of emotional fulfillment and the potential for a loving relationship. This card encourages you to embrace your feelings and to communicate openly with your partner. It's a reminder that true love is built on trust, respect, and understanding. Cherish the bond you share and nurture your relationship.",
      "reversed": "Reversed, the 2 of Cups indicates relationship problems, break-up, imbalance, and distrust. You may be feeling disconnected from your partner or struggling to find common ground. This card suggests the need to focus on healing and nurturing yourself before seeking connection with others. It's a reminder that healthy relationships start with a strong foundation of self-love and respect."
    },
    "career": {
      "upright": "In your career, the 2 of Cups upright signifies good partnerships, teamwork, collaboration, and balance. It represents a time of harmony and mutual support in the workplace. This card encourages you to build strong connections with your colleagues and to work together towards common goals. It's a reminder that successful collaborations are built on trust, respect, and open communication. Embrace the opportunities for partnership and teamwork that come your way.",
      "reversed": "Reversed, the 2 of Cups indicates poor partnerships, workplace conflict, and imbalance. You may be experiencing tension or misunderstandings with your coworkers. This card suggests the need to address any issues and to find ways to restore harmony in your professional relationships. It's a reminder that healthy work relationships start with mutual respect and open communication."
    }
  },
  "3 of Cups": {
    "general": {
      "upright": "The 3 of Cups upright signifies celebration, friendship, creativity, and community. It represents a time of joy and the importance of social connections. This card encourages you to embrace your relationships and to celebrate the bonds you share with others. It's a reminder that happiness is often found in the company of loved ones and that collaboration can lead to creative breakthroughs. Embrace the positive energy and support that comes from being part of a community.",
      "reversed": "Reversed, the 3 of Cups indicates independence, alone time, hardcore partying, and social approval. You may be feeling the need to step back from social obligations or to focus on your own needs. This card suggests the importance of finding balance between socializing and self-care. It's a reminder that while community is important, it's also essential to nurture your own well-being and to seek approval from within rather than relying on external validation."
    },
    "love": {
      "upright": "The 3 of Cups upright signifies relationship celebration, friendship, and emotional support. It represents a time of joy and the importance of social connections in your romantic life. This card encourages you to embrace your relationships and to celebrate the bonds you share with your partner. It's a reminder that happiness in love is often found in the company of loved ones and that collaboration can lead to deeper emotional connections.",
      "reversed": "Reversed, the 3 of Cups indicates third party interference, jealousy, lack of support. You may be feeling the need to address any issues in your relationship or to seek support from your friends. This card suggests the importance of open communication and honesty in your romantic life. It's a reminder that while social connections are important, it's also essential to prioritize your relationship and to nurture the bond you share with your partner."
    },
    "career": {
      "upright": "In your career, the 3 of Cups upright signifies team success, workplace celebration, collaboration, and support. It represents a time of joy and the importance of building strong connections with your colleagues. This card encourages you to embrace teamwork and to celebrate the achievements of those around you. It's a reminder that success is often found in collaboration and that supporting one another can lead to greater fulfillment in your professional life.",
      "reversed": "Reversed, the 3 of Cups indicates office politics, lack of teamwork, and workplace isolation. You may be feeling disconnected from your colleagues or struggling to find common ground. This card suggests the need to address any issues and to find ways to restore harmony in your professional relationships. It's a reminder that healthy work relationships start with mutual respect and open communication."
    }
  },
  "4 of Cups": {
    "general": {
      "upright": "The 4 of Cups upright signifies meditation, contemplation, apathy, reevaluation, and boredom. It represents a time of introspection and the need to take a step back from the distractions of the world. This card encourages you to check in with yourself and to consider what truly matters to you. It's a reminder that sometimes, you need to withdraw in order to gain clarity and to reconnect with your inner self.",
      "reversed": "Reversed, the 4 of Cups indicates retreat, withdrawal, checking in with yourself, and self-absorption. You may be feeling the need to take a break from external distractions and to focus on your own needs. This card suggests the importance of self-care and finding ways to nurture your well-being. It's a reminder that introspection can lead to personal growth and that taking time for yourself is essential for maintaining balance in your life."
    },
    "love": {
      "upright": "The 4 of Cups upright signifies relationship boredom, taking love for granted, and apathy. It represents a time of introspection and the need to reevaluate your romantic life. This card encourages you to check in with yourself and to consider what truly matters in your relationships. It's a reminder that sometimes, you need to withdraw in order to gain clarity and to reconnect with your partner.",
      "reversed": "Reversed, the 4 of Cups indicates self-reflection about love and withdrawal from the relationship. It suggests the need to take a step back and to consider what you truly want and need in your romantic life. This card encourages open communication and honesty with your partner."
    },
    "career": {
      "upright": "The 4 of Cups upright signifies career apathy, boredom at work, and missed opportunities. It represents a time of introspection and the need to reevaluate your professional life. This card encourages you to check in with yourself and to consider what truly matters in your career. It's a reminder that sometimes, you need to withdraw in order to gain clarity and to reconnect with your passions.",
      "reversed": "Reversed, the 4 of Cups indicates self-reflection about career and withdrawal from work. It suggests the need to take a step back and to consider what you truly want and need in your professional life. This card encourages open communication and honesty with yourself about your career goals."
    }
  },
  "5 of Cups": {
    "general": {
      "upright": "The 5 of Cups upright signifies loss, grief, disappointment, and focusing on the negative. It represents a time of emotional turmoil and the need to process your feelings. This card encourages you to acknowledge your pain and to allow yourself to grieve. It's a reminder that while it's important to honor your emotions, it's also essential to look for the silver lining and to find ways to move forward. Embrace the lessons learned from your experiences and focus on healing.",
      "reversed": "Reversed, the 5 of Cups indicates moving on from grief, acceptance, forgiveness, and finding peace. You may be starting to see the light at the end of the tunnel and finding ways to heal from your emotional wounds. This card suggests the importance of self-compassion and the need to let go of past disappointments. It's a reminder that while loss is a part of life, it doesn't define you. Embrace the opportunities for growth and renewal that come from moving forward."
    },
    "love": {
      "upright": "The 5 of Cups upright signifies relationship disappointment, break-up, loss, and grief. It represents a time of emotional turmoil and the need to process your feelings about your romantic life. This card encourages you to acknowledge your pain and to allow yourself to grieve the loss of a relationship. It's a reminder that while it's important to honor your emotions, it's also essential to look for the silver lining and to find ways to move forward.",
      "reversed": "Reversed, the 5 of Cups indicates moving on from a relationship, self-forgiveness, and acceptance. You may be starting to see the light at the end of the tunnel and finding ways to heal from your emotional wounds. This card suggests the importance of self-compassion and the need to let go of past disappointments in love. It's a reminder that while loss is a part of life, it doesn't define you. Embrace the opportunities for growth and renewal that come from moving forward in your romantic life."
    },
    "career": {
      "upright": "The 5 of Cups upright signifies career disappointment, job loss, failure, and regret. It represents a time of emotional turmoil and the need to process your feelings about your professional life. This card encourages you to acknowledge your pain and to allow yourself to grieve the loss of a job or career opportunity. It's a reminder that while it's important to honor your emotions, it's also essential to look for the silver lining and to find ways to move forward.",
      "reversed": "Reversed, the 5 of Cups indicates moving on from a career setback, learning from failure, and finding new opportunities. You may be starting to see the light at the end of the tunnel and finding ways to heal from your professional wounds. This card suggests the importance of self-compassion and the need to let go of past disappointments in your career."
    }
  },
  "6 of Cups": {
    "general": {
      "upright": "The 6 of Cups upright signifies revisiting the past, childhood memories, innocence, joy, and nostalgia. It represents a time of reflection and the need to connect with your inner child. This card encourages you to embrace the positive aspects of your past and to find joy in simple pleasures. It's a reminder that while the past can hold pain, it can also offer valuable lessons and a sense of comfort.",
      "reversed": "Reversed, the 6 of Cups indicates living in the past, forgetting past lessons, and lacking playfulness. You may be clinging to old memories or experiences that no longer serve you. This card suggests the importance of letting go of nostalgia and finding ways to embrace the present. It's a reminder that while the past is a part of you, it doesn't have to define your future. Focus on creating new memories and finding joy in the here and now."
    },
    "love": {
      "upright": "The 6 of Cups upright signifies childhood sweetheart, innocent love, nostalgia, and past love returning. It represents a time of emotional healing and the need to reconnect with your romantic roots. This card encourages you to embrace the joy and innocence of love, and to find ways to bring that energy into your current relationships. It's a reminder that love can be a source of comfort and happiness, and that revisiting past connections can lead to new beginnings.",
      "reversed": "Reversed, the 6 of Cups indicates living in a past relationship, immature love, and unrealistic expectations. You may be clinging to an idealized version of love that no longer exists. This card suggests the importance of letting go of past disappointments and finding ways to embrace the present. It's a reminder that while nostalgia can be comforting, it can also hold you back from experiencing true love."
    },
    "career": {
      "upright": "The 6 of Cups upright signifies positive work environment, teamwork, and revisiting past career opportunities. It represents a time of emotional fulfillment and the need to connect with your professional roots. This card encourages you to embrace the joy and camaraderie of your workplace, and to find ways to bring that energy into your current career. It's a reminder that collaboration and positive relationships can lead to success and satisfaction in your professional life.",
      "reversed": "Reversed, the 6 of Cups indicates being stuck in past career, immature approach to work, and unrealistic career goals. You may be clinging to old jobs or experiences that no longer serve you. This card suggests the importance of letting go of nostalgia and finding ways to embrace the present. It's a reminder that while the past is a part of you, it doesn't have to define your future. Focus on creating new opportunities and finding fulfillment in your current career."
    }
  },
  "7 of Cups": {
    "general": {
      "upright": "Here, the 7 of Cups upright signifies opportunities, choices, wishful thinking, illusion, and fantasy. It represents a time of exploration and the need to consider various possibilities. This card encourages you to dream big and to envision the life you desire. However, it's also a reminder to stay grounded and to avoid getting lost in unrealistic fantasies. This card suggests the importance of discernment and making choices that align with your true values and goals.",
      "reversed": "Reversed, the 7 of Cups indicates a need for clarity and focus. You may be feeling overwhelmed by choices or distractions, and it's important to align your decisions with your true values. This card suggests the importance of prioritizing your goals and finding ways to cut through the noise. It's a reminder that while dreaming is important, taking practical steps toward your aspirations is essential for success. Focus on what truly matters and make choices that lead you closer to your desired outcome."
    },
    "love": {
      "upright": "The 7 of Cups upright signifies many romantic options, fantasy love, and unrealistic expectations. It represents a time of exploration and the need to consider various possibilities in your love life. This card encourages you to dream big and to envision the type of relationship you desire. However, it's also a reminder to stay grounded and to avoid getting lost in unrealistic fantasies about love. This card suggests the importance of discernment and making choices that align with your true values and emotional needs.",
      "reversed": "Reversed, the 7 of Cups indicates clarity in love, realistic expectations, and focused choices. You may be starting to see through illusions and fantasies in your romantic life. This card suggests the importance of prioritizing your emotional needs and finding ways to make practical decisions about love. It's a reminder that while dreaming is important, taking realistic steps toward building a fulfilling relationship is essential for long-term happiness. Focus on what truly matters in your love life and make choices that lead you closer to emotional fulfillment."
    },
    "career": {
      "upright": "The 7 of Cups upright signifies many career options, unrealistic career goals, and fantasy. It represents a time of exploration and the need to consider various possibilities in your professional life. This card encourages you to dream big and to envision the type of career you desire. However, it's also a reminder to stay grounded and to avoid getting lost in unrealistic fantasies about work. This card suggests the importance of discernment and making choices that align with your true values and professional aspirations.",
      "reversed": "Reversed, the 7 of Cups indicates career clarity, realistic goals, and focused choices. You may be starting to see through illusions and fantasies in your professional life. This card suggests the importance of prioritizing your career needs and finding ways to make practical decisions about your work life. It's a reminder that while dreaming is important, taking realistic steps toward building a fulfilling career is essential for long-term success. Focus on what truly matters in your professional life and make choices that lead you closer to your career goals."
    }
  },
  "8 of Cups": {
    "general": {
      "upright": "This card signifies walking away, leaving behind the past, seeking deeper meaning, and emotional withdrawal. It represents a time of transition and the need to let go of what no longer serves you. This card encourages you to embrace change and to seek out new experiences that align with your true self. It's a reminder that sometimes, in order to grow and find fulfillment, you must be willing to leave behind familiar situations and step into the unknown. Trust that by following your heart, you will find the path that is right for you.",
      "reversed": "The 8 of Cups reversed indicates avoidance of change, fear of moving on, and stagnation. You may be feeling stuck or uncertain about leaving behind the past. This card suggests the need to confront your fears and to find ways to embrace change. It's a reminder that growth and fulfillment often require stepping out of your comfort zone and being willing to explore new paths. Focus on what truly matters to you and take steps toward creating a more meaningful life. Don't let fear hold you back from pursuing your true desires."
    },
    "love": {
      "upright": "The 8 of Cups upright signifies leaving a relationship, seeking deeper emotional fulfillment, and walking away from unfulfilling love. It represents a time of transition and the need to let go of what no longer serves you in your romantic life. This card encourages you to embrace change and to seek out relationships that align with your true emotional needs. It's a reminder that sometimes, in order to find true love and happiness, you must be willing to leave behind familiar situations and step into the unknown. Trust that by following your heart, you will find the relationship that is right for you.",
      "reversed": "Reversed, the 8 of Cups indicates fear of moving on from a relationship, avoidance of change, and stagnation. You may be feeling stuck or uncertain about leaving behind a romantic situation that no longer serves you. This card suggests the need to confront your fears and to find ways to embrace change in your love life. It's a reminder that growth and fulfillment often require stepping out of your comfort zone and being willing to explore new paths. Focus on what truly matters to you and take steps toward creating a more meaningful romantic life. Don't let fear hold you back from pursuing your true desires."
    },
    "career": {
      "upright": "The 8 of Cups upright signifies leaving a job, seeking deeper fulfillment, and walking away from unfulfilling work. It represents a time of transition and the need to let go of what no longer serves you in your professional life. This card encourages you to embrace change and to seek out career paths that align with your true aspirations. It's a reminder that sometimes, in order to find true success and happiness, you must be willing to leave behind familiar situations and step into the unknown. Trust that by following your heart, you will find the career path that is right for you.",
      "reversed": "Reversed, the 8 of Cups indicates fear of moving on from a job, avoidance of change, and stagnation. You may be feeling stuck or uncertain about leaving behind a professional situation that no longer serves you. This card suggests the need to confront your fears and to find ways to embrace change in your career. It's a reminder that growth and fulfillment often require stepping out of your comfort zone and being willing to explore new paths. Focus on what truly matters to you and take steps toward creating a more meaningful professional life. Don't let fear hold you back from pursuing your true desires."
    }
  },
  "9 of Cups": {
    "general": {
      "upright": "This card signifies contentment, satisfaction, emotional fulfillment, and wish come true. It represents a time of happiness and the realization of your desires. This card encourages you to embrace the joy and abundance that comes from achieving your goals. It's a reminder that when you focus on gratitude and appreciate what you have, you can create a life of fulfillment and satisfaction. Celebrate your achievements and continue to pursue your dreams with confidence. You have the power to manifest your desires and create a life that brings you joy.",
      "reversed": "The 9 of Cups reversed indicates dissatisfaction, unfulfilled desires, and taking things for granted. You may be feeling a sense of emptiness or disappointment despite achieving your goals. This card suggests the need to reassess your priorities and to find ways to cultivate deeper fulfillment in your life. It's a reminder that true happiness comes from within and that material success alone may not bring lasting satisfaction. Focus on what truly matters to you and seek out experiences that nourish your soul. Embrace gratitude and find joy in the present moment."
    },
    "love": {
      "upright": "In this context, the 9 of Cups upright signifies relationship contentment, emotional fulfillment, and wish come true in love. It represents a time of happiness and the realization of your romantic desires. This card encourages you to embrace the joy and abundance that comes from achieving your relationship goals. It's a reminder that when you focus on gratitude and appreciate what you have in your love life, you can create a fulfilling and satisfying relationship. Celebrate your romantic achievements and continue to pursue your desires with confidence.",
      "reversed": "Here, the 9 of Cups reversed indicates relationship dissatisfaction, unfulfilled desires, and taking love for granted. You may be feeling a sense of emptiness or disappointment in your romantic life despite achieving certain goals. This card suggests the need to reassess your relationship priorities and to find ways to cultivate deeper fulfillment with your partner. It's a reminder that true happiness in love comes from within and that material success alone may not bring lasting satisfaction. Focus on what truly matters in your relationship and seek out experiences that nourish your emotional connection. Embrace gratitude and find joy in the present moment with your partner."
    },
    "career": {
      "upright": "In this context, the 9 of Cups upright signifies career satisfaction, achievement, and wish fulfillment. It represents a time of happiness and the realization of your professional goals. This card encourages you to embrace the joy and abundance that comes from achieving your career aspirations. It's a reminder that when you focus on gratitude and appreciate what you have in your work life, you can create a fulfilling and satisfying career. Celebrate your professional achievements and continue to pursue your desires with confidence.",
      "reversed": "Here, the 9 of Cups reversed indicates career dissatisfaction, unfulfilled desires, and taking work for granted. You may be feeling a sense of emptiness or disappointment in your professional life despite achieving certain goals. This card suggests the need to reassess your career priorities and to find ways to cultivate deeper fulfillment in your work. It's a reminder that true happiness in your career comes from within and that material success alone may not bring lasting satisfaction. Focus on what truly matters in your professional life and seek out experiences that nourish your passion. Embrace gratitude and find joy in the present moment at work."
    }
  },
  "10 of Cups": {
    "general": {
      "upright": "The 10 of Cups upright signifies happiness, fulfillment, emotional harmony, and lasting success. It represents a time of joy and the realization of your emotional desires. This card encourages you to embrace the love and support that surrounds you and to celebrate the meaningful connections in your life. It's a reminder that true happiness comes from within and that when you nurture your relationships, you create a foundation for lasting fulfillment. Embrace the positive energy and abundance that this card represents, and cherish the moments of joy with your loved ones.",
      "reversed": "Reversed, the 10 of Cups indicates family discord, broken relationships, and misalignment of values. You may be experiencing tension or misunderstandings with your loved ones. This card suggests the need to address any issues and to find ways to restore harmony in your relationships. It's a reminder that healthy connections start with open communication and mutual respect. Focus on healing and nurturing your relationships to create a more fulfilling emotional life."
    },
    "love": {
      "upright": "The 10 of Cups upright signifies relationship happiness, emotional fulfillment, and lasting love. It represents a time of joy and the realization of your romantic desires. This card encourages you to embrace the love and support that surrounds you and to celebrate the meaningful connections in your relationship. It's a reminder that true happiness in love comes from within and that when you nurture your partnership, you create a foundation for lasting fulfillment. Embrace the positive energy and abundance that this card represents, and cherish the moments of joy with your partner.",
      "reversed": "Reversed, the 10 of Cups indicates relationship discord, broken connections, and misalignment of values. You may be experiencing tension or misunderstandings with your partner. This card suggests the need to address any issues and to find ways to restore harmony in your relationship. It's a reminder that healthy love starts with open communication and mutual respect. Focus on healing and nurturing your partnership to create a more fulfilling romantic life."
    },
    "career": {
      "upright": "The 10 of Cups upright signifies workplace harmony, successful teamwork, and emotional fulfillment at work. It represents a time of joy and the realization of your professional desires. This card encourages you to embrace the positive relationships you have with your colleagues and to celebrate the meaningful connections in your workplace. It's a reminder that true happiness in your career comes from within and that when you nurture your professional relationships, you create a foundation for lasting fulfillment. Embrace the positive energy and abundance that this card represents, and cherish the moments of joy in your work life.",
      "reversed": "Reversed, the 10 of Cups indicates workplace discord, broken professional relationships, and misalignment of values. You may be experiencing tension or misunderstandings with your colleagues. This card suggests the need to address any issues and to find ways to restore harmony in your professional relationships. It's a reminder that healthy work connections start with open communication and mutual respect. Focus on healing and nurturing your workplace relationships to create a more fulfilling career."
    }
  },
  "Page of Cups": {
    "general": {
      "upright": "This card signifies new emotional beginnings, creativity, intuition, and youthful energy. It represents a time of openness and the potential for emotional growth. This card encourages you to embrace your creative side and to listen to your intuition. It's a reminder that new opportunities for emotional fulfillment may be on the horizon, and that by staying open and curious, you can discover new paths to happiness. Embrace the playful and imaginative energy of this card, and allow yourself to explore new emotional experiences. This is a time to nurture your inner child and to express your feelings freely.",
      "reversed": "Reversed, the Page of Cups indicates creative blocks, doubting intuition, and emotional immaturity. You may be struggling to express your feelings or to connect with your inner self. This card suggests the need to address any fears or insecurities that may be holding you back. It's a reminder that true emotional growth comes from within and that by nurturing your creativity and intuition, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the playful and imaginative energy of this card, and allow yourself to explore new emotional experiences."
    },
    "love": {
      "upright": "The Page of Cups upright signifies new romantic opportunities, emotional openness, and youthful love. It represents a time of exploration and the potential for emotional growth in your romantic life. This card encourages you to embrace your feelings and to listen to your intuition when it comes to matters of the heart. It's a reminder that new opportunities for love may be on the horizon, and that by staying open and curious, you can discover new paths to happiness in your relationships. Embrace the playful and imaginative energy of this card, and allow yourself to explore new emotional experiences in love.",
      "reversed": "Reversed, the Page of Cups indicates emotional immaturity, creative blocks, and doubting intuition in love. You may be struggling to express your feelings or to connect with your inner self in your romantic life. This card suggests the need to address any fears or insecurities that may be holding you back from experiencing true love. It's a reminder that true emotional growth comes from within and that by nurturing your creativity and intuition, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the playful and imaginative energy of this card, and allow yourself to explore new emotional experiences in love."
    },
    "career": {
      "upright": "The Page of Cups upright signifies new creative opportunities, emotional fulfillment, and youthful energy in your career. It represents a time of exploration and the potential for growth in your professional life. This card encourages you to embrace your creative side and to listen to your intuition when it comes to your work. It's a reminder that new opportunities for success may be on the horizon, and that by staying open and curious, you can discover new paths to fulfillment in your career. Embrace the playful and imaginative energy of this card, and allow yourself to explore new professional experiences.",
      "reversed": "Reversed, the Page of Cups indicates creative blocks, doubting intuition, and emotional immaturity in your career. You may be struggling to express your ideas or to connect with your inner self in your professional life. This card suggests the need to address any fears or insecurities that may be holding you back from achieving success. It's a reminder that true growth comes from within and that by nurturing your creativity and intuition, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the playful and imaginative energy of this card, and allow yourself to explore new professional experiences."
    }
  },
  "Knight of Cups": {
    "general": {
      "upright": "What you have here is the Knight of Cups upright, which signifies romance, charm, imagination, and following your heart. It represents a time of emotional exploration and the pursuit of your dreams. This card encourages you to embrace your creative side and to listen to your intuition. It's a reminder that by following your heart, you can discover new paths to happiness and fulfillment. Embrace the romantic and imaginative energy of this card, and allow yourself to explore new emotional experiences. This is a time to be open to love and to express your feelings freely.",
      "reversed": "Reversed, the Knight of Cups indicates moodiness, unrealistic expectations, and being out of touch with emotions. You may be struggling to express your feelings or to connect with your inner self. This card suggests the need to address any fears or insecurities that may be holding you back. It's a reminder that true emotional growth comes from within and that by nurturing your creativity and intuition, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the romantic and imaginative energy of this card, and allow yourself to explore new emotional experiences."
    },
    "love": {
      "upright": "In terms of love, the Knight of Cups upright signifies a romantic partner, charm, and following your heart in relationships. It represents a time of emotional exploration and the pursuit of your romantic dreams. This card encourages you to embrace your feelings and to listen to your intuition when it comes to matters of the heart. It's a reminder that by following your heart, you can discover new paths to happiness in your relationships. Embrace the romantic and imaginative energy of this card, and allow yourself to explore new emotional experiences in love. This is a time to be open to love and to express your feelings freely.",
      "reversed": "Reversed, the Knight of Cups indicates unrealistic expectations, moodiness, and being out of touch with emotions in love. You may be struggling to express your feelings or to connect with your inner self in your romantic life. This card suggests the need to address any fears or insecurities that may be holding you back from experiencing true love. It's a reminder that true emotional growth comes from within and that by nurturing your creativity and intuition, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the romantic and imaginative energy of this card, and allow yourself to explore new emotional experiences in love."
    },
    "career": {
      "upright": "The Knight of Cups upright signifies creative career opportunities, following your passion, and emotional fulfillment at work. It represents a time of exploration and the pursuit of your professional dreams. This card encourages you to embrace your creative side and to listen to your intuition when it comes to your career. It's a reminder that by following your heart, you can discover new paths to success and fulfillment in your professional life. Embrace the romantic and imaginative energy of this card, and allow yourself to explore new professional experiences. This is a time to be open to new opportunities and to express your ideas freely.",
      "reversed": "Reversed, the Knight of Cups indicates unrealistic career expectations, moodiness, and being out of touch with emotions at work. You may be struggling to express your ideas or to connect with your inner self in your professional life. This card suggests the need to address any fears or insecurities that may be holding you back from achieving success. It's a reminder that true growth comes from within and that by nurturing your creativity and intuition, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the romantic and imaginative energy of this card, and allow yourself to explore new professional experiences."
    }
  },
  "Queen of Cups": {
    "general": {
      "upright": "The card here is the Queen of Cups upright, which signifies compassion, emotional security, intuition, and nurturing. It represents a time of emotional balance and the ability to care for others while also taking care of yourself. This card encourages you to embrace your empathetic nature and to listen to your intuition. It's a reminder that by nurturing your own emotional well-being, you can better support those around you. Embrace the compassionate and nurturing energy of this card, and allow yourself to connect deeply with your emotions. This is a time to be kind to yourself and others, and to create a sense of emotional harmony in your life.",
      "reversed": "Reversed, the Queen of Cups indicates emotional insecurity, co-dependency, and being out of touch with emotions. You may be struggling to care for yourself or to connect with your inner self. This card suggests the need to address any fears or insecurities that may be holding you back. It's a reminder that true emotional balance comes from within and that by nurturing your own well-being, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the compassionate and nurturing energy of this card, and allow yourself to connect deeply with your emotions."
    },
    "love": {
      "upright": "The Queen of Cups upright signifies a caring and nurturing partner, emotional security, and deep connection in relationships. It represents a time of emotional balance and the ability to support your loved ones while also taking care of yourself. This card encourages you to embrace your empathetic nature and to listen to your intuition in your romantic life. It's a reminder that by nurturing your own emotional well-being, you can better support your partner. Embrace the compassionate and nurturing energy of this card, and allow yourself to connect deeply with your emotions in love.",
      "reversed": "Reversed, the Queen of Cups indicates emotional insecurity, codependency, and being out of touch with emotions in love. You may be struggling to care for yourself or to connect with your inner self in your romantic life. This card suggests the need to address any fears or insecurities that may be holding you back from experiencing true love. It's a reminder that true emotional balance comes from within and that by nurturing your own well-being, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the compassionate and nurturing energy of this card, and allow yourself to connect deeply with your emotions in love."
    },
    "career": {
      "upright": "The Queen of Cups upright signifies compassionate leadership, emotional intelligence, and nurturing workplace relationships. It represents a time of emotional balance and the ability to support your colleagues while also taking care of yourself. This card encourages you to embrace your empathetic nature and to listen to your intuition in your professional life. It's a reminder that by nurturing your own emotional well-being, you can better support your team. Embrace the compassionate and nurturing energy of this card, and allow yourself to create a sense of emotional harmony in your workplace.",
      "reversed": "Reversed, the Queen of Cups indicates emotional insecurity, codependency, and being out of touch with emotions at work. You may be struggling to care for yourself or to connect with your inner self in your professional life. This card suggests the need to address any fears or insecurities that may be holding you back from achieving success. It's a reminder that true emotional balance comes from within and that by nurturing your own well-being, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the compassionate and nurturing energy of this card, and allow yourself to create a sense of emotional harmony in your workplace."
    }
  },
  "King of Cups": {
    "general": {
      "upright": "This card is the King of Cups upright, which signifies emotional balance, compassion, diplomacy, and wisdom. It represents a time of mastery over your emotions and the ability to navigate complex situations with grace and understanding. This card encourages you to embrace your empat",
      "reversed": "Reversed, the King of Cups indicates emotional manipulation, moodiness, and being out of touch with emotions. You may be struggling to maintain emotional balance or to connect with your inner self. This card suggests the need to address any fears or insecurities that may be holding you back. It's a reminder that true emotional mastery comes from within and that by nurturing your own well-being, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the compassionate and diplomatic energy of this card, and allow yourself to navigate complex situations with grace."
    },
    "love": {
      "upright": "The King of Cups upright signifies a compassionate and emotionally balanced partner, diplomatic communication, and deep emotional connection in relationships. It represents a time of mastery over your emotions and the ability to navigate complex romantic situations with grace and understanding. This card encourages you to embrace your empathetic nature and to listen to your intuition in your love life. It's a reminder that by nurturing your own emotional well-being, you can better support your partner and create a harmonious relationship. Embrace the compassionate and diplomatic energy of this card, and allow yourself to navigate complex romantic situations with grace.",
      "reversed": "Reversed, the King of Cups indicates emotional manipulation, moodiness, and being out of touch with emotions in love. You may be struggling to maintain emotional balance or to connect with your inner self in your romantic life. This card suggests the need to address any fears or insecurities that may be holding you back from experiencing true love. It's a reminder that true emotional mastery comes from within and that by nurturing your own well-being, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the compassionate and diplomatic energy of this card, and allow yourself to navigate complex romantic situations with grace."
    },
    "career": {
      "upright": "The King of Cups upright signifies emotionally intelligent leadership, diplomatic communication, and compassionate decision-making in the workplace. It represents a time of mastery over your emotions and the ability to navigate complex professional situations with grace and understanding. This card encourages you to embrace your empathetic nature and to listen to your intuition in your career. It's a reminder that by nurturing your own emotional well-being, you can better support your colleagues and create a harmonious work environment. Embrace the compassionate and diplomatic energy of this card, and allow yourself to navigate complex workplace situations with grace.",
      "reversed": "Reversed, the King of Cups indicates emotional manipulation, moodiness, and being out of touch with emotions at work. You may be struggling to maintain emotional balance or to connect with your inner self in your professional life. This card suggests the need to address any fears or insecurities that may be holding you back from achieving success. It's a reminder that true emotional mastery comes from within and that by nurturing your own well-being, you can overcome these challenges. Focus on self-care and seek support from others if needed. Embrace the compassionate and diplomatic energy of this card, and allow yourself to navigate complex workplace situations with grace."
    }
  },
  "Ace of Swords": {
    "general": {
      "upright": "Here, the Ace of Swords upright signifies new ideas, mental clarity, breakthroughs, and sharp thinking. It represents a time of intellectual growth and the potential for new beginnings. This card encourages you to embrace your analytical side and to think critically about your goals and aspirations. It's a reminder that by gaining clarity and insight, you can overcome challenges and achieve success. Embrace the powerful and focused energy of this card, and allow yourself to explore new ideas and perspectives. This is a time to be decisive and to take action toward your goals.",
      "reversed": "Reversed, the Ace of Swords indicates confusion, lack of clarity, and mental blocks. You may be struggling to think clearly or to make decisions. This card suggests the need to address any doubts or uncertainties that may be holding you back. It's a reminder that true mental clarity comes from within and that by focusing your thoughts and intentions, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the powerful and focused energy of this card, and allow yourself to explore new ideas and perspectives. This is a time to be patient and to wait for the right moment to take action."
    },
    "love": {
      "upright": "The Ace of Swords upright signifies clear communication, new perspectives, and breakthroughs in relationships. It represents a time of intellectual growth and the potential for new beginnings in your love life. This card encourages you to embrace open and honest communication with your partner and to think critically about your relationship goals. It's a reminder that by gaining clarity and insight, you can overcome challenges and achieve a deeper connection. Embrace the powerful and focused energy of this card, and allow yourself to explore new ideas and perspectives in love. This is a time to be decisive and to take action toward building a stronger relationship.",
      "reversed": "Reversed, the Ace of Swords indicates relationship confusion, lack of clarity, and communication blocks. You may be struggling to think clearly or to express your feelings in your romantic life. This card suggests the need to address any doubts or uncertainties that may be holding you back. It's a reminder that true mental clarity comes from within and that by focusing your thoughts and intentions, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the powerful and focused energy of this card, and allow yourself to explore new ideas and perspectives in love."
    },
    "career": {
      "upright": "The Ace of Swords upright signifies new ideas, mental clarity, and breakthroughs in your career. It represents a time of intellectual growth and the potential for new beginnings in your professional life. This card encourages you to embrace your analytical side and to think critically about your career goals. It's a reminder that by gaining clarity and insight, you can overcome challenges and achieve success in your work. Embrace the powerful and focused energy of this card, and allow yourself to explore new ideas and perspectives in your career. This is a time to be decisive and to take action toward your professional aspirations.",
      "reversed": "Reversed, the Ace of Swords indicates career confusion, lack of clarity, and mental blocks. You may be struggling to think clearly or to make decisions in your professional life. This card suggests the need to address any doubts or uncertainties that may be holding you back. It's a reminder that true mental clarity comes from within and that by focusing your thoughts and intentions, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the powerful and focused energy of this card, and allow yourself to explore new ideas and perspectives in your career."
    }
  },
  "2 of Swords": {
    "general": {
      "upright": "The 2 of Swords upright signifies difficult decisions, stalemate, indecision, and blocked emotions. It represents a time of uncertainty and the need to make choices. This card encourages you to confront your fears and to find ways to move forward. It's a reminder that avoiding decisions can lead to stagnation and that by facing your challenges head-on, you can create positive change. Embrace the need for balance and clarity, and allow yourself to explore your options. This is a time to trust your intuition and to make choices that align with your true self.",
      "reversed": "Reversed, the 2 of Swords indicates confusion, indecision, and information overload. You may be struggling to make choices or to find clarity in your situation. This card suggests the need to address any fears or uncertainties that may be holding you back. It's a reminder that true clarity comes from within and that by focusing your thoughts and intentions, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the need for balance and clarity, and allow yourself to explore your options. This is a time to trust your intuition and to make choices that align with your true self."
    },
    "love": {
      "upright": "The 2 of Swords upright signifies relationship decisions, stalemate, and blocked emotions. It represents a time of uncertainty in your romantic life and the need to make choices. This card encourages you to confront your fears and to find ways to move forward in your relationship. It's a reminder that avoiding decisions can lead to stagnation and that by facing your challenges head-on, you can create positive change. Embrace the need for balance and clarity, and allow yourself to explore your options in love. This is a time to trust your intuition and to make choices that align with your true desires.",
      "reversed": "Reversed, the 2 of Swords indicates relationship confusion, indecision, and information overload. You may be struggling to make choices or to find clarity in your romantic life. This card suggests the need to address any fears or uncertainties that may be holding you back. It's a reminder that true clarity comes from within and that by focusing your thoughts and intentions, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the need for balance and clarity, and allow yourself to explore your options in love."
    },
    "career": {
      "upright": "The 2 of Swords upright signifies career decisions, stalemate, and blocked progress. It represents a time of uncertainty in your professional life and the need to make choices. This card encourages you to confront your fears and to find ways to move forward in your career. It's a reminder that avoiding decisions can lead to stagnation and that by facing your challenges head-on, you can create positive change. Embrace the need for balance and clarity, and allow yourself to explore your options in your career. This is a time to trust your intuition and to make choices that align with your true aspirations.",
      "reversed": "Reversed, the 2 of Swords indicates career confusion, indecision, and information overload. You may be struggling to make choices or to find clarity in your professional life. This card suggests the need to address any fears or uncertainties that may be holding you back. It's a reminder that true clarity comes from within and that by focusing your thoughts and intentions, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the need for balance and clarity, and allow yourself to explore your options in your career."
    }
  },
  "3 of Swords": {
    "general": {
      "upright": "3 of Swords upright signifies heartbreak, emotional pain, sorrow, grief, hurt, and trauma. It represents a time of deep emotional turmoil and the need to process difficult feelings. This card encourages you to confront your pain and to seek healing. It's a reminder that by acknowledging your emotions, you can begin to heal and move forward. Embrace the transformative energy of this card, and allow yourself to feel and release your emotions. This is a time to focus on self-care and to seek support from others if needed. Remember that healing is a journey, and with time, you can find peace and renewal.",
      "reversed": "3 of Swords reversed signifies negative self-talk, releasing pain, optimism, and forgiveness. It represents a time of healing and the potential for emotional growth. This card encourages you to let go of past hurts and to focus on self-care. It's a reminder that by forgiving yourself and others, you can create space for new beginnings. Embrace the healing energy of this card, and allow yourself to move forward with optimism. This is a time to focus on personal growth and to seek support from others if needed. Remember that healing is a journey, and with time, you can find peace and renewal."
    },
    "love": {
      "upright": "3 of Swords upright signifies heartbreak, betrayal, separation, sorrow, and emotional pain. It represents a time of deep emotional turmoil in your romantic life and the need to process difficult feelings. This card encourages you to confront your pain and to seek healing in your relationship. It's a reminder that by acknowledging your emotions, you can begin to heal and move forward. Embrace the transformative energy of this card, and allow yourself to feel and release your emotions. This is a time to focus on self-care and to seek support from others if needed. Remember that healing is a journey, and with time, you can find peace and renewal in love.",
      "reversed": "3 of Swords reversed signifies healing from heartbreak, forgiveness, and moving on. It represents a time of emotional growth and the potential for new beginnings in your romantic life. This card encourages you to let go of past hurts and to focus on self-care. It's a reminder that by forgiving yourself and others, you can create space for new love. Embrace the healing energy of this card, and allow yourself to move forward with optimism. This is a time to focus on personal growth and to seek support from others if needed. Remember that healing is a journey, and with time, you can find peace and renewal in love."
    },
    "career": {
      "upright": "3 of Swords upright signifies workplace betrayal, job disappointment, and career heartbreak. It represents a time of deep emotional turmoil in your professional life and the need to process difficult feelings. This card encourages you to confront your pain and to seek healing in your career. It's a reminder that by acknowledging your emotions, you can begin to heal and move forward. Embrace the transformative energy of this card, and allow yourself to feel and release your emotions. This is a time to focus on self-care and to seek support from others if needed. Remember that healing is a journey, and with time, you can find peace and renewal in your career.",
      "reversed": "3 of Swords reversed signifies healing from career disappointment and moving forward. It represents a time of emotional growth and the potential for new beginnings in your professional life. This card encourages you to let go of past hurts and to focus on self-care. It's a reminder that by forgiving yourself and others, you can create space for new opportunities. Embrace the healing energy of this card, and allow yourself to move forward with optimism. This is a time to focus on personal growth and to seek support from others if needed. Remember that healing is a journey, and with time, you can find peace and renewal in your career."
    }
  },
  "4 of Swords": {
    "general": {
      "upright": "This card is the 4 of Swords upright, which signifies rest, recovery, contemplation, and solitude. It represents a time of pause and the need to recharge your energy. This card encourages you to take a break from the hustle and bustle of life and to focus on self-care. It's a reminder that by allowing yourself time to rest and reflect, you can gain clarity and perspective. Embrace the peaceful energy of this card, and allow yourself to find solace in solitude. This is a time to nurture your mind, body, and spirit, and to prepare for the next phase of your journey.",
      "reversed": "Reversed, the 4 of Swords indicates burnout, restlessness, and the need to recover from stress. You may be struggling to find peace and balance in your life. This card suggests the need to address any overwhelming situations that may be causing you distress. It's a reminder that true recovery comes from within and that by prioritizing self-care, you can overcome these challenges. Focus on finding moments of calm and solitude, and seek support from others if needed. Embrace the peaceful energy of this card, and allow yourself to recharge and rejuvenate."
    },
    "love": {
      "upright": "The 4 of Swords upright signifies a relationship break, rest from emotional turmoil, and contemplation. It represents a time of pause in your romantic life and the need to recharge your emotional energy. This card encourages you to take a break from relationship stress and to focus on self-care. It's a reminder that by allowing yourself time to rest and reflect, you can gain clarity and perspective in your relationship. Embrace the peaceful energy of this card, and allow yourself to find solace in solitude. This is a time to nurture your mind, body, and spirit, and to prepare for the next phase of your romantic journey.",
      "reversed": "Reversed, the 4 of Swords indicates relationship burnout, restlessness, and the need to recover from emotional stress. You may be struggling to find peace and balance in your romantic life. This card suggests the need to address any overwhelming situations that may be causing you distress in your relationship. It's a reminder that true recovery comes from within and that by prioritizing self-care, you can overcome these challenges. Focus on finding moments of calm and solitude, and seek support from others if needed. Embrace the peaceful energy of this card, and allow yourself to recharge and rejuvenate in your relationship."
    },
    "career": {
      "upright": "The 4 of Swords upright signifies a work break, recovery from career stress, and contemplation. It represents a time of pause in your professional life and the need to recharge your energy. This card encourages you to take a break from work-related stress and to focus on self-care. It's a reminder that by allowing yourself time to rest and reflect, you can gain clarity and perspective in your career. Embrace the peaceful energy of this card, and allow yourself to find solace in solitude. This is a time to nurture your mind, body, and spirit, and to prepare for the next phase of your professional journey.",
      "reversed": "Reversed, the 4 of Swords indicates workplace burnout, restlessness, and the need to recover from career stress. You may be struggling to find peace and balance in your professional life. This card suggests the need to address any overwhelming situations that may be causing you distress at work. It's a reminder that true recovery comes from within and that by prioritizing self-care, you can overcome these challenges. Focus on finding moments of calm and solitude, and seek support from others if needed. Embrace the peaceful energy of this card, and allow yourself to recharge and rejuvenate in your career."
    }
  },
  "5 of Swords": {
    "general": {
      "upright": "The 5 of Swords upright signifies conflict, disagreement, competition, and betrayal. It represents a time of tension and the need to navigate difficult situations. This card encourages you to confront challenges head-on and to find ways to resolve conflicts. It's a reminder that while winning may seem important, it's essential to consider the impact on others. Embrace the lessons learned from these experiences, and allow yourself to grow from adversity. This is a time to reflect on your values and to seek harmony in your interactions with others.",
      "reversed": "Reversed, the 5 of Swords indicates a desire to make amends and to find common ground. It represents a time of healing and the potential for reconciliation after conflict. This card encourages you to let go of past grievances and to approach situations with empathy and understanding. It's a reminder that true victory comes from collaboration and compromise. Embrace the opportunity to mend relationships and to foster a sense of unity with others."
    },
    "love": {
      "upright": "Here, the 5 of Swords upright signifies relationship conflict, arguments, and betrayal. It represents a time of tension in your romantic life and the need to navigate difficult situations with your partner. This card encourages you to confront challenges head-on and to find ways to resolve conflicts in your relationship. It's a reminder that while winning an argument may seem important, it's essential to consider the impact on your partner. Embrace the lessons learned from these experiences, and allow yourself to grow from adversity in love.",
      "reversed": "Reversed, the 5 of Swords indicates a desire to make amends and to find common ground in your relationship. It represents a time of healing and the potential for reconciliation after conflict with your partner. This card encourages you to let go of past grievances and to approach situations with empathy and understanding. It's a reminder that true victory in love comes from collaboration and compromise. Embrace the opportunity to mend your relationship and to foster a sense of unity with your partner."
    },
    "career": {
      "upright": "The 5 of Swords upright signifies workplace conflict, competition, and betrayal. It represents a time of tension in your professional life and the need to navigate difficult situations at work. This card encourages you to confront challenges head-on and to find ways to resolve conflicts with colleagues. It's a reminder that while winning may seem important, it's essential to consider the impact on your professional relationships. Embrace the lessons learned from these experiences, and allow yourself to grow from adversity in your career.",
      "reversed": "Reversed, the 5 of Swords indicates a desire to make amends and to find common ground in your workplace. It represents a time of healing and the potential for reconciliation after conflict with colleagues. This card encourages you to let go of past grievances and to approach situations with empathy and understanding. It's a reminder that true victory at work comes from collaboration and compromise. Embrace the opportunity to mend professional relationships and to foster a sense of unity with your team."
    }
  },
  "6 of Swords": {
    "general": {
      "upright": "The 6 of Swords upright signifies transition, change, rite of passage, and moving on. It represents a time of leaving behind difficulties and moving toward a calmer, more peaceful state. This card encourages you to embrace change and to let go of any emotional baggage that may be holding you back. It's a reminder that by moving forward, you can create space for new opportunities and personal growth. Embrace the transformative energy of this card, and allow yourself to heal and move forward on your journey.",
      "reversed": "Reversed, the 6 of Swords indicates resistance to change, unfinished business, and emotional baggage. You may be struggling to let go of the past or to move forward in your life. This card suggests the need to address any fears or insecurities that may be holding you back. It's a reminder that true growth comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward on your journey."
    },
    "love": {
      "upright": "The 6 of Swords upright signifies relationship transition, moving on from past hurts, and emotional healing. It represents a time of leaving behind difficulties in your romantic life and moving toward a calmer, more peaceful state. This card encourages you to embrace change and to let go of any emotional baggage that may be holding you back. It's a reminder that by moving forward, you can create space for new love and emotional growth. Embrace the transformative energy of this card, and allow yourself to heal and move forward in your relationships.",
      "reversed": "Reversed, the 6 of Swords indicates resistance to relationship change, unfinished business, and emotional baggage. You may be struggling to let go of past hurts or to move forward in your romantic life. This card suggests the need to address any fears or insecurities that may be holding you back. It's a reminder that true growth comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward in your relationships."
    },
    "career": {
      "upright": "The 6 of Swords upright signifies career transition, moving on from past challenges, and professional growth. It represents a time of leaving behind difficulties in your professional life and moving toward a calmer, more peaceful state. This card encourages you to embrace change and to let go of any professional baggage that may be holding you back. It's a reminder that by moving forward, you can create space for new opportunities and career growth. Embrace the transformative energy of this card, and allow yourself to heal and move forward in your career.",
      "reversed": "Reversed, the 6 of Swords indicates resistance to career change, unfinished business, and professional baggage. You may be struggling to let go of past challenges or to move forward in your professional life. This card suggests the need to address any fears or insecurities that may be holding you back. It's a reminder that true growth comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward in your career."
    }
  },
  "7 of Swords": {
    "general": {
      "upright": "Here, the 7 of Swords upright signifies deception, trickery, strategy, and stealth. It represents a time of cunning and the need to navigate situations with care. This card encourages you to be strategic in your actions and to think ahead. It's a reminder that while sometimes deception may seem necessary, it's essential to consider the ethical implications of your choices. Embrace the clever energy of this card, and allow yourself to find creative solutions to challenges. This is a time to be cautious and to protect your interests.",
      "reversed": "Reversed, the 7 of Swords indicates imposter syndrome, self-deception, keeping secrets, and getting caught. You may be struggling with feelings of inadequacy or the fear of being exposed. This card suggests the need to confront any dishonesty or deception in your life, whether it's coming from within or from external sources. It's a reminder that true authenticity comes from being honest with yourself and others. Focus on self-reflection and seek support from trusted individuals if needed. Embrace the transformative energy of this card, and allow yourself to break free from any self-imposed limitations."
    },
    "love": {
      "upright": "The 7 of Swords upright signifies relationship deception, secrets, and strategic behavior. It represents a time of cunning in your romantic life and the need to navigate situations with care. This card encourages you to be strategic in your actions and to think ahead in your relationship. It's a reminder that while sometimes deception may seem necessary, it's essential to consider the ethical implications of your choices with your partner. Embrace the clever energy of this card, and allow yourself to find creative solutions to relationship challenges.",
      "reversed": "Reversed, the 7 of Swords indicates coming clean in a relationship, guilt, and imposter syndrome. You may be struggling with feelings of inadequacy or the fear of being exposed. This card suggests the need to confront any dishonesty or deception in your romantic life, whether it's coming from within or from external sources. It's a reminder that true authenticity comes from being honest with yourself and your partner. Focus on self-reflection and seek support from trusted individuals if needed. Embrace the transformative energy of this card, and allow yourself to break free from any self-imposed limitations."
    },
    "career": {
      "upright": "The 7 of Swords upright signifies workplace deception, strategy, and stealth. It represents a time of cunning in your professional life and the need to navigate situations with care. This card encourages you to be strategic in your actions and to think ahead in your career. It's a reminder that while sometimes deception may seem necessary, it's essential to consider the ethical implications of your choices at work. Embrace the clever energy of this card, and allow yourself to find creative solutions to workplace challenges. This is a time to be cautious and to protect your professional interests.",
      "reversed": "Reversed, the 7 of Swords indicates getting caught at work, guilt, and imposter syndrome. You may be struggling with feelings of inadequacy or the fear of being exposed. This card suggests the need to confront any dishonesty or deception in your professional life, whether it's coming from within or from external sources. It's a reminder that true authenticity comes from being honest with yourself and others. Focus on self-reflection and seek support from trusted individuals if needed. Embrace the transformative energy of this card, and allow yourself to break free from any self-imposed limitations."
    }
  },
  "8 of Swords": {
    "general": {
      "upright": "8 of Swords upright signifies feeling trapped, restricted, and powerless. It represents a time of self-imposed limitations and the need to find ways to break free. This card encourages you to confront your fears and to challenge the beliefs that are holding you back. It's a reminder that while you may feel stuck, you have the power to change your situation. Embrace the liberating energy of this card, and allow yourself to explore new perspectives. This is a time to trust in your abilities and to take steps toward freedom.",
      "reversed": "Reversed, the 8 of Swords indicates breaking free from limiting beliefs, self-empowerment, and release from restrictions. You may be starting to see a way out of your current situation and to regain control over your life. This card suggests the need to challenge any fears or doubts that may be holding you back. It's a reminder that true freedom comes from within and that by embracing your inner strength, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the liberating energy of this card, and allow yourself to break free from any self-imposed limitations."
    },
    "love": {
      "upright": "8 of Swords upright signifies feeling trapped in a relationship, limited options in love, and victim mentality. It represents a time of self-imposed limitations in your romantic life and the need to find ways to break free. This card encourages you to confront your fears and to challenge the beliefs that are holding you back in love. It's a reminder that while you may feel stuck, you have the power to change your situation. Embrace the liberating energy of this card, and allow yourself to explore new perspectives in your relationships. This is a time to trust in your abilities and to take steps toward freedom in love.",
      "reversed": "Reversed, the 8 of Swords indicates breaking free from relationship limitations, self-empowerment, and release from restrictions in love. You may be starting to see a way out of your current romantic situation and to regain control over your love life. This card suggests the need to challenge any fears or doubts that may be holding you back in relationships. It's a reminder that true freedom comes from within and that by embracing your inner strength, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the liberating energy of this card, and allow yourself to break free from any self-imposed limitations in love."
    },
    "career": {
      "upright": "8 of Swords upright signifies feeling trapped in a job, limited career options, and professional restrictions. It represents a time of self-imposed limitations in your professional life and the need to find ways to break free. This card encourages you to confront your fears and to challenge the beliefs that are holding you back in your career. It's a reminder that while you may feel stuck, you have the power to change your situation. Embrace the liberating energy of this card, and allow yourself to explore new perspectives in your professional life. This is a time to trust in your abilities and to take steps toward freedom in your career.",
      "reversed": "Reversed, the 8 of Swords indicates breaking free from career limitations, self-empowerment, and release from professional restrictions. You may be starting to see a way out of your current job situation and to regain control over your career. This card suggests the need to challenge any fears or doubts that may be holding you back professionally. It's a reminder that true freedom comes from within and that by embracing your inner strength, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the liberating energy of this card, and allow yourself to break free from any self-imposed limitations in your career."
    }
  },
  "9 of Swords": {
    "general": {
      "upright": "9 of Swords upright signifies anxiety, worry, fear, depression, and nightmares. It represents a time of mental anguish and the need to address troubling thoughts. This card encourages you to confront your fears and to find ways to alleviate your worries. It's a reminder that while you may feel overwhelmed, you have the power to change your mindset. Embrace the healing energy of this card, and allow yourself to seek support and find peace. This is a time to focus on self-care and to work toward mental clarity.",
      "reversed": "Reversed, the 9 of Swords indicates releasing anxiety, overcoming fears, and finding hope. You may be starting to see a way out of your mental anguish and to regain control over your thoughts. This card suggests the need to challenge any negative beliefs that may be holding you back. It's a reminder that true peace comes from within and that by embracing a positive mindset, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the healing energy of this card, and allow yourself to find peace and clarity."
    },
    "love": {
      "upright": "9 of Swords upright signifies relationship anxiety, fear of loss, and emotional distress. It represents a time of mental anguish in your romantic life and the need to address troubling thoughts about your relationship. This card encourages you to confront your fears and to find ways to alleviate your worries in love. It's a reminder that while you may feel overwhelmed, you have the power to change your mindset. Embrace the healing energy of this card, and allow yourself to seek support and find peace in your relationship. This is a time to focus on self-care and to work toward emotional clarity.",
      "reversed": "Reversed, the 9 of Swords indicates releasing relationship anxiety, overcoming fears, and finding hope in love. You may be starting to see a way out of your mental anguish regarding your romantic life and to regain control over your thoughts. This card suggests the need to challenge any negative beliefs that may be holding you back in your relationship. It's a reminder that true peace comes from within and that by embracing a positive mindset, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the healing energy of this card, and allow yourself to find peace and clarity in your relationship."
    },
    "career": {
      "upright": "9 of Swords upright signifies career anxiety, fear of failure, and professional distress. It represents a time of mental anguish in your professional life and the need to address troubling thoughts about your career. This card encourages you to confront your fears and to find ways to alleviate your worries at work. It's a reminder that while you may feel overwhelmed, you have the power to change your mindset. Embrace the healing energy of this card, and allow yourself to seek support and find peace in your career. This is a time to focus on self-care and to work toward professional clarity.",
      "reversed": "Reversed, the 9 of Swords indicates releasing career anxiety, overcoming fears, and finding hope in your professional life. You may be starting to see a way out of your mental anguish regarding your job and to regain control over your thoughts. This card suggests the need to challenge any negative beliefs that may be holding you back in your career. It's a reminder that true peace comes from within and that by embracing a positive mindset, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the healing energy of this card, and allow yourself to find peace and clarity in your career."
    }
  },
  "10 of Swords": {
    "general": {
      "upright": "Here, the 10 of Swords upright signifies painful endings, betrayal, loss, and crisis. It represents a time of deep emotional turmoil and the need to confront difficult situations. This card encourages you to acknowledge your pain and to seek healing. It's a reminder that while endings can be challenging, they also create space for new beginnings. Embrace the transformative energy of this card, and allow yourself to heal and move forward. This is a time to focus on self-care and to seek support from others if needed. Remember that healing is a journey, and with time, you can find peace and renewal.",
      "reversed": "Reversed, the 10 of Swords indicates recovery from pain, regeneration, and transformation. You may be starting to heal from past hurts and to regain control over your life. This card suggests the need to confront any lingering pain or trauma that may be holding you back. It's a reminder that true healing comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward on your journey."
    },
    "love": {
      "upright": "10 of Swords upright signifies relationship betrayal, painful endings, and heartbreak. It represents a time of deep emotional turmoil in your romantic life and the need to confront difficult situations with your partner. This card encourages you to acknowledge your pain and to seek healing in your relationship. It's a reminder that while endings can be challenging, they also create space for new beginnings in love. Embrace the transformative energy of this card, and allow yourself to heal and move forward in your relationships.",
      "reversed": "Recovering from breakup, healing, transformation in love. You may be starting to heal from past relationship hurts and to regain control over your romantic life. This card suggests the need to confront any lingering pain or trauma that may be holding you back in love. It's a reminder that true healing comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward in your relationships."
    },
    "career": {
      "upright": "10 of Swords upright signifies career betrayal, painful endings, and professional loss. It represents a time of deep emotional turmoil in your professional life and the need to confront difficult situations at work. This card encourages you to acknowledge your pain and to seek healing in your career. It's a reminder that while endings can be challenging, they also create space for new beginnings in your professional life. Embrace the transformative energy of this card, and allow yourself to heal and move forward in your career.",
      "reversed": "Reversed, the 10 of Swords indicates recovery from career pain, regeneration, and professional transformation. You may be starting to heal from past job hurts and to regain control over your career. This card suggests the need to confront any lingering pain or trauma that may be holding you back professionally. It's a reminder that true healing comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward in your career."
    }
  },
  "Page of Swords": {
    "general": {
      "upright": "The Page of Swords upright signifies curiosity, new ideas, mental agility, and communication. It represents a time of intellectual exploration and the need to embrace new perspectives. This card encourages you to be open-minded and to seek knowledge. It's a reminder that by staying curious and adaptable, you can navigate challenges with ease. Embrace the energetic and inquisitive nature of this card, and allow yourself to explore new ideas. This is a time to communicate your thoughts clearly and to remain flexible in your thinking.",
      "reversed": "Reversed, the Page of Swords indicates all talk no action, haste, deception, and scattered energy. You may be struggling to focus your thoughts or to communicate effectively. This card suggests the need to address any distractions or misinformation that may be clouding your judgment. It's a reminder that true clarity comes from within and that by focusing your mind, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the energetic nature of this card, and allow yourself to find focus and direction."
    },
    "love": {
      "upright": "In terms of love, the Page of Swords upright signifies curious and communicative energy in relationships. It represents a time of intellectual connection and the need to embrace new perspectives with your partner. This card encourages you to be open-minded and to seek knowledge about your relationship. It's a reminder that by staying curious and adaptable, you can navigate relationship challenges with ease. Embrace the energetic and inquisitive nature of this card, and allow yourself to explore new ideas in love.",
      "reversed": "Reversed, the Page of Swords indicates all talk no action in relationships, haste, deception, and scattered energy. You may be struggling to focus your thoughts or to communicate effectively with your partner. This card suggests the need to address any distractions or misinformation that may be clouding your judgment in love. It's a reminder that true clarity comes from within and that by focusing your mind, you can overcome these challenges in your relationship. Focus on self-reflection and seek support from others if needed. Embrace the energetic nature of this card, and allow yourself to find focus and direction in love."
    },
    "career": {
      "upright": "The Page of Swords upright signifies curiosity, new ideas, mental agility, and communication in the workplace. It represents a time of intellectual exploration and the need to embrace new perspectives in your career. This card encourages you to be open-minded and to seek knowledge about your professional life. It's a reminder that by staying curious and adaptable, you can navigate workplace challenges with ease. Embrace the energetic and inquisitive nature of this card, and allow yourself to explore new ideas at work.",
      "reversed": "Reversed, the Page of Swords indicates all talk no action in the workplace, haste, deception, and scattered energy. You may be struggling to focus your thoughts or to communicate effectively at work. This card suggests the need to address any distractions or misinformation that may be clouding your judgment in your career. It's a reminder that true clarity comes from within and that by focusing your mind, you can overcome these challenges professionally. Focus on self-reflection and seek support from others if needed. Embrace the energetic nature of this card, and allow yourself to find focus and direction in your career."
    }
  },
  "Knight of Swords": {
    "general": {
      "upright": "The Knight of Swords upright signifies swift action, determination, and intellectual pursuit. It represents a time of decisiveness and the need to cut through confusion with clarity and focus. This card encourages you to embrace your mental agility and to pursue your goals with confidence. It's a reminder that by staying true to your convictions and acting with purpose, you can overcome obstacles and achieve success. Embrace the dynamic energy of this card, and allow yourself to take bold steps forward.",
      "reversed": "Reversed, the Knight of Swords indicates recklessness, haste, and a lack of direction. You may be feeling scattered or unfocused, struggling to find your footing in a fast-paced environment. This card suggests the need to slow down and reassess your priorities. It's a reminder that true progress comes from thoughtful action and that by taking the time to reflect, you can regain your sense of purpose. Focus on self-reflection and seek support from others if needed. Embrace the energetic nature of this card, and allow yourself to find clarity and direction."
    },
    "love": {
      "upright": "In love, the Knight of Swords upright signifies impulsive romance, direct communication, and swift action in relationships. It represents a time of decisiveness and the need to cut through confusion with clarity and focus in your romantic life. This card encourages you to embrace your mental agility and to pursue your relationship goals with confidence. It's a reminder that by staying true to your convictions and acting with purpose, you can overcome obstacles and achieve success in love.",
      "reversed": "Reversed, the Knight of Swords indicates reckless behavior in relationships, haste, and a lack of direction. You may be feeling scattered or unfocused, struggling to find your footing in your romantic life. This card suggests the need to slow down and reassess your relationship priorities. It's a reminder that true progress in love comes from thoughtful action and that by taking the time to reflect, you can regain your sense of purpose in your relationship."
    },
    "career": {
      "upright": "The Knight of Swords upright signifies swift career moves, determination, and intellectual pursuit in the workplace. It represents a time of decisiveness and the need to cut through confusion with clarity and focus in your professional life. This card encourages you to embrace your mental agility and to pursue your career goals with confidence. It's a reminder that by staying true to your convictions and acting with purpose, you can overcome obstacles and achieve success in your career.",
      "reversed": "Reversed, the Knight of Swords indicates reckless behavior at work, haste, and a lack of direction. You may be feeling scattered or unfocused, struggling to find your footing in your professional life. This card suggests the need to slow down and reassess your career priorities. It's a reminder that true progress at work comes from thoughtful action and that by taking the time to reflect, you can regain your sense of purpose in your career."
    }
  },
  "Queen of Swords": {
    "general": {
      "upright": "Queen of Swords upright signifies independence, clear communication, intellectual maturity, and unbiased judgement. It represents a time of mental clarity and the need to approach situations with honesty and integrity. This card encourages you to embrace your inner strength and to communicate your thoughts and feelings with confidence. It's a reminder that by staying true to your values and thinking critically, you can navigate challenges with grace and wisdom. Embrace the empowering energy of this card, and allow yourself to lead with both your mind and your heart.",
      "reversed": "Reversed, the Queen of Swords indicates coldness in thought, harsh judgment, and lack of empathy. You may be struggling to connect with others on an emotional level or to see situations from different perspectives. This card suggests the need to address any emotional barriers that may be hindering your relationships. It's a reminder that true wisdom comes from balancing intellect with compassion. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate empathy and understanding."
    },
    "love": {
      "upright": "In love, the Queen of Swords upright signifies clear communication, intellectual connection, and independence in relationships. It represents a time of mental clarity and the need to approach your romantic life with honesty and integrity. This card encourages you to embrace your inner strength and to communicate your thoughts and feelings with confidence in your relationship. It's a reminder that by staying true to your values and thinking critically, you can navigate relationship challenges with grace and wisdom.",
      "reversed": "Reversed, the Queen of Swords indicates coldness in relationships, harsh judgment, and lack of empathy. You may be struggling to connect with your partner on an emotional level or to see situations from their perspective. This card suggests the need to address any emotional barriers that may be hindering your relationship. It's a reminder that true wisdom in love comes from balancing intellect with compassion. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate empathy and understanding in your relationship."
    },
    "career": {
      "upright": "Queen of Swords upright signifies clear communication, intellectual leadership, and unbiased judgement in the workplace. It represents a time of mental clarity and the need to approach professional situations with honesty and integrity. This card encourages you to embrace your inner strength and to communicate your thoughts and ideas with confidence at work. It's a reminder that by staying true to your values and thinking critically, you can navigate workplace challenges with grace and wisdom.",
      "reversed": "Reversed, the Queen of Swords indicates coldness in thought at work, harsh judgment, and lack of empathy. You may be struggling to connect with colleagues on an emotional level or to see situations from different perspectives. This card suggests the need to address any emotional barriers that may be hindering your professional relationships. It's a reminder that true wisdom in the workplace comes from balancing intellect with compassion. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate empathy and understanding in your career."
    }
  },
  "King of Swords": {
    "general": {
      "upright": "King of Swords upright signifies intellectual authority, clear thinking, truth, and leadership. It represents a time of mental clarity and the need to approach situations with honesty and integrity. This card encourages you to embrace your inner strength and to communicate your thoughts and feelings with confidence. It's a reminder that by staying true to your values and thinking critically, you can navigate challenges with grace and wisdom. Embrace the empowering energy of this card, and allow yourself to lead with both your mind and your heart.",
      "reversed": "Reversed, the King of Swords indicates misuse of power, manipulation, and cold communication. You may be struggling to connect with others on an emotional level or to see situations from different perspectives. This card suggests the need to address any ethical concerns that may be hindering your relationships. It's a reminder that true leadership comes from balancing intellect with compassion. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate empathy and understanding."
    },
    "love": {
      "upright": "In love, the King of Swords upright signifies clear communication, intellectual connection, and honest leadership in relationships. It represents a time of mental clarity and the need to approach your romantic life with honesty and integrity. This card encourages you to embrace your inner strength and to communicate your thoughts and feelings with confidence in your relationship. It's a reminder that by staying true to your values and thinking critically, you can navigate relationship challenges with grace and wisdom.",
      "reversed": "Reversed, the King of Swords indicates misuse of power in relationships, manipulation, and cold communication. You may be struggling to connect with your partner on an emotional level or to see situations from their perspective. This card suggests the need to address any ethical concerns that may be hindering your relationship. It's a reminder that true leadership in love comes from balancing intellect with compassion. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate empathy and understanding in your relationship."
    },
    "career": {
      "upright": "King of Swords upright signifies intellectual authority, clear thinking, and honest leadership in the workplace. It represents a time of mental clarity and the need to approach professional situations with honesty and integrity. This card encourages you to embrace your inner strength and to communicate your thoughts and ideas with confidence at work. It's a reminder that by staying true to your values and thinking critically, you can navigate workplace challenges with grace and wisdom.",
      "reversed": "Reversed, the King of Swords indicates misuse of power at work, manipulation, and cold communication. You may be struggling to connect with colleagues on an emotional level or to see situations from different perspectives. This card suggests the need to address any ethical concerns that may be hindering your professional relationships. It's a reminder that true leadership in the workplace comes from balancing intellect with compassion. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate empathy and understanding in your career."
    }
  },
  "Ace of Pentacles": {
    "general": {
      "upright": "Ace of Pentacles upright signifies new financial opportunities, prosperity, manifestation, and abundance. It represents a time of material growth and the potential for new beginnings in your financial life. This card encourages you to embrace opportunities for wealth and stability. It's a reminder that by focusing on your goals and taking practical steps, you can manifest abundance in your life. Embrace the grounding energy of this card, and allow yourself to build a solid foundation for your future.", 
      "reversed": "Reversed, the Ace of Pentacles indicates missed financial opportunities, poor planning, and instability. You may be struggling to find your footing in your financial life or to manifest your goals. This card suggests the need to reassess your approach to wealth and stability. It's a reminder that true abundance comes from careful planning and practical action. Focus on self-reflection and seek support from others if needed. Embrace the grounding energy of this card, and allow yourself to build a solid foundation for your future."
    },
    "love": {
      "upright": "When upright, the Ace of Pentacles signifies a prosperous relationship built on a solid foundation. It represents material security in love, engagement, and the potential for long-term commitment. This card encourages you to embrace the practical aspects of your relationship and to nurture it with care and attention. It's a reminder that by investing in your partnership and focusing on shared goals, you can create a lasting and fulfilling bond.",
      "reversed": "Reversed, the Ace of Pentacles indicates financial strain on the relationship, materialism in love, and a focus on superficial aspects rather than emotional connection. You may be feeling insecure or unstable in your partnership, leading to conflicts over money or resources. This card suggests the need to address any imbalances and to prioritize emotional intimacy over material concerns. It's a reminder that true security in love comes from mutual support and understanding."
    },
    "career": {
      "upright": "When upright, the Ace of Pentacles signifies new job opportunities, financial gain, and career manifestation. It represents a time of growth and the potential for success in your professional life. This card encourages you to embrace new beginnings and to take practical steps towards your career goals. It's a reminder that by focusing on your skills and abilities, you can create a solid foundation for your future.",
      "reversed": "Reversed, the Ace of Pentacles indicates lost career opportunities, poor financial planning, and a lack of stability in your professional life. You may be feeling unfulfilled or stuck in your current job, leading to frustration and disappointment. This card suggests the need to reassess your career path and to take action towards creating the success you desire. It's a reminder that true stability in your career comes from careful planning and practical action."
    }
  },
  "2 of Pentacles": {
    "general": {
      "upright": "The 2 of Cups upright signifies a strong connection and partnership between two individuals. It represents mutual respect, love, and understanding. This card encourages you to embrace your relationships and to nurture the bonds you share with others. It's a reminder that true love and connection come from open communication and emotional honesty. Embrace the harmony and balance that this card represents, and cherish the meaningful connections in your life.",
      "reversed": "Reversed, the 2 of Pentacles indicates imbalance, overwhelm, and difficulty juggling multiple priorities. You may be struggling to find harmony in your life or to manage your responsibilities effectively. This card suggests the need to reassess your priorities and to find ways to create balance. It's a reminder that true stability comes from being adaptable and flexible in the face of change. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to find equilibrium in your life."
    },
    "love": {
      "upright": "Here, the 2 of Pentacles upright signifies balance and harmony in relationships. It represents the ability to juggle multiple aspects of love and partnership with ease. This card encourages you to embrace the ebb and flow of your relationship and to find joy in the give-and-take dynamic. It's a reminder that true love thrives on adaptability and mutual support. Embrace the playful energy of this card, and allow yourself to enjoy the dance of love.",
      "reversed": "Reversed, the 2 of Pentacles indicates relationship imbalance, overwhelm, and difficulty managing multiple aspects of love. You may be struggling to find harmony in your romantic life or to juggle the demands of your relationship effectively. This card suggests the need to reassess your priorities and to find ways to create balance in love. It's a reminder that true stability in relationships comes from being adaptable and flexible. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to find equilibrium in your romantic life."
    },
    "career": {
      "upright": "The 2 of Pentacles upright signifies balance and adaptability in the workplace. It represents the ability to juggle multiple tasks and responsibilities with ease. This card encourages you to embrace change and to find joy in the dynamic nature of your career. It's a reminder that true success comes from being flexible and open to new opportunities. Embrace the energetic flow of this card, and allow yourself to thrive in your professional life.",
      "reversed": "Reversed, the 2 of Pentacles indicates career imbalance, overwhelm, and difficulty managing multiple tasks. You may be struggling to find harmony in your professional life or to juggle your responsibilities effectively. This card suggests the need to reassess your priorities and to find ways to create balance at work. It's a reminder that true stability in your career comes from being adaptable and flexible. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to find equilibrium in your professional life."
    }
  },
  "3 of Pentacles": {
    "general": {
      "upright": "The 3 of Pentacles upright signifies teamwork, collaboration, and the successful implementation of ideas. It represents the importance of working together towards a common goal and the value of each individual's contributions. This card encourages you to embrace the power of collaboration and to recognize the strengths of those around you. It's a reminder that true success comes from a harmonious blend of talents and efforts. Embrace the supportive energy of this card, and allow yourself to thrive in a collaborative environment. This is a time to focus on shared goals and to celebrate collective achievements.",
      "reversed": "Reversed, the 3 of Pentacles indicates lack of teamwork, poor collaboration, and disharmony in group efforts. You may be struggling to work effectively with others or to find common ground in a shared project. This card suggests the need to reassess your approach to collaboration and to address any conflicts that may be hindering progress. It's a reminder that true success comes from open communication and mutual respect. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to improve your teamwork skills."
    },
    "love": {
      "upright": "Looking in the perspective of love, the 3 of Pentacles upright signifies relationship teamwork, mutual support, and building a strong foundation together. It represents the importance of working collaboratively with your partner to create a fulfilling and harmonious relationship. This card encourages you to embrace the power of partnership and to recognize the strengths that each of you brings to the relationship. It's a reminder that true love thrives on cooperation and shared goals. Embrace the supportive energy of this card, and allow yourself to nurture your relationship through teamwork.",
      "reversed": "Reversed, the 3 of Pentacles indicates relationship disharmony, lack of teamwork, and poor collaboration with your partner. You may be struggling to work effectively together or to find common ground in your relationship. This card suggests the need to reassess your approach to partnership and to address any conflicts that may be hindering your connection. It's a reminder that true love thrives on open communication and mutual respect. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to improve teamwork in your relationship."
    },
    "career": {
      "upright": "The 3 of Pentacles upright signifies workplace collaboration, team success, and the effective implementation of ideas. It represents the importance of working together with colleagues towards common professional goals. This card encourages you to embrace the power of teamwork and to recognize the strengths of those around you in your career. It's a reminder that true success in the workplace comes from a harmonious blend of talents and efforts. Embrace the supportive energy of this card, and allow yourself to thrive in a collaborative professional environment.",
      "reversed": "Reversed, the 3 of Pentacles indicates workplace disharmony, lack of teamwork, and poor collaboration with colleagues. You may be struggling to work effectively with others or to find common ground in a shared project at work. This card suggests the need to reassess your approach to professional collaboration and to address any conflicts that may be hindering progress. It's a reminder that true success in your career comes from open communication and mutual respect. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to improve your teamwork skills in the workplace."
    }
  },
  "4 of Pentacles": {
    "general": {
      "upright": "This card signifies stability, security, and a conservative approach to finances and material possessions. It represents the importance of holding onto what you have and being cautious with your resources. This card encourages you to embrace a practical mindset and to focus on building a solid foundation for your future. It's a reminder that true security comes from careful planning and wise management of your assets. Embrace the grounding energy of this card, and allow yourself to create a stable and secure environment. This is a time to focus on financial responsibility and long-term planning.",
      "reversed": "Reversed, the 4 of Pentacles indicates financial insecurity, overspending, and a lack of stability in your material life. You may be struggling to hold onto your resources or to manage your finances effectively. This card suggests the need to reassess your approach to money and possessions. It's a reminder that true security comes from careful planning and wise management of your assets. Focus on self-reflection and seek support from others if needed. Embrace the grounding energy of this card, and allow yourself to create a stable and secure environment."
    },
    "love": {
      "upright": "In love, the 4 of Pentacles upright signifies stability, security, and a conservative approach to relationships. It represents the importance of holding onto what you have and being cautious with your emotional investments. This card encourages you to embrace a practical mindset and to focus on building a solid foundation for your relationship. It's a reminder that true security in love comes from careful planning and wise management of your emotional resources. Embrace the grounding energy of this card, and allow yourself to create a stable and secure relationship.",
      "reversed": "Reversed, the 4 of Pentacles indicates relationship insecurity, possessiveness, and a lack of stability in your romantic life. You may be struggling to hold onto your partner or to manage your emotional investments effectively. This card suggests the need to reassess your approach to love and relationships. It's a reminder that true security in love comes from careful planning and wise management of your emotional resources. Focus on self-reflection and seek support from others if needed. Embrace the grounding energy of this card, and allow yourself to create a stable and secure relationship."
    },
    "career": {
      "upright": "The 4 of Pentacles upright signifies financial stability, job security, and a conservative approach to your career. It represents the importance of holding onto your position and being cautious with your professional resources. This card encourages you to embrace a practical mindset and to focus on building a solid foundation for your career. It's a reminder that true security in your professional life comes from careful planning and wise management of your assets. Embrace the grounding energy of this card, and allow yourself to create a stable and secure work environment.",
      "reversed": "Reversed, the 4 of Pentacles indicates career insecurity, job instability, and a lack of stability in your professional life. You may be struggling to hold onto your position or to manage your professional resources effectively. This card suggests the need to reassess your approach to your career. It's a reminder that true security in your professional life comes from careful planning and wise management of your assets. Focus on self-reflection and seek support from others if needed. Embrace the grounding energy of this card, and allow yourself to create a stable and secure work environment."
    }
  },
  "5 of Pentacles": {
    "general": {
      "upright": "5 of Pentacles upright signifies financial loss, poverty, isolation, and worry. It represents a time of hardship and the need to confront difficult situations with resilience and determination. This card encourages you to acknowledge your struggles and to seek support from others. It's a reminder that while challenges can be overwhelming, they also create opportunities for growth and transformation. Embrace the transformative energy of this card, and allow yourself to find strength in adversity. This is a time to focus on self-care and to seek help if needed.",
      "reversed": "Recovering from financial loss, finding hope, and renewed security. You may be starting to heal from past financial hardships and to regain control over your material life. This card suggests the need to confront any lingering worries or fears that may be holding you back. It's a reminder that true security comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward on your journey toward stability."
    },
    "love": {
      "upright": "Relationship loss, isolation, emotional hardship, worry. This card represents a time of emotional turmoil in your romantic life and the need to confront difficult situations with resilience and determination. It encourages you to acknowledge your pain and to seek support from others. It's a reminder that while challenges in love can be overwhelming, they also create opportunities for growth and transformation. Embrace the transformative energy of this card, and allow yourself to find strength in adversity within your relationships.",
      "reversed": "Recovery from relationship loss, finding hope, renewed emotional security. You may be starting to heal from past relationship hurts and to regain control over your romantic life. This card suggests the need to confront any lingering pain or trauma that may be holding you back in love. It's a reminder that true healing comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward in your relationships."
    },
    "career": {
      "upright": "Career setback, financial hardship, professional isolation, worry. This card represents a time of difficulty in your professional life and the need to confront challenging situations with resilience and determination. It encourages you to acknowledge your struggles and to seek support from others. It's a reminder that while career challenges can be overwhelming, they also create opportunities for growth and transformation. Embrace the transformative energy of this card, and allow yourself to find strength in adversity in your career.",
      "reversed": "Recovery from career setbacks, finding hope, renewed professional security. You may be starting to heal from past job hurts and to regain control over your career. This card suggests the need to confront any lingering pain or trauma that may be holding you back professionally. It's a reminder that true healing comes from within and that by embracing change, you can overcome these challenges. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to move forward in your career."
    }
  },
  "6 of Pentacles": {
    "general": {
      "upright": "The 6 of Pentacles upright signifies generosity, charity, balance, and financial harmony. It represents the importance of giving and receiving in equal measure and the value of sharing your resources with others. This card encourages you to embrace a generous mindset and to recognize the impact of your actions on those around you. It's a reminder that true abundance comes from a balanced exchange of energy and resources. Embrace the harmonious energy of this card, and allow yourself to create a positive flow of giving and receiving in your life. This is a time to focus on generosity and mutual support.",
      "reversed": "Reversed, the 6 of Pentacles indicates imbalance in giving and receiving, selfishness, and strings attached. You may be struggling to find harmony in your financial life or to manage your resources effectively. This card suggests the need to reassess your approach to generosity and to address any imbalances that may be hindering your relationships. It's a reminder that true abundance comes from a balanced exchange of energy and resources. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to create a positive flow of giving and receiving."
    },
    "love": {
      "upright": "Here, the 6 of Pentacles signifies a balanced and mutually supportive relationship. It represents the importance of giving and receiving love in equal measure and the value of emotional generosity. This card encourages you to embrace a mindset of abundance in your relationships and to recognize the impact of your actions on your partner. It's a reminder that true love flourishes in an environment of reciprocity and support. Embrace the harmonious energy of this card, and allow yourself to create a positive flow of giving and receiving in your love life.",
      "reversed": "In reverse, the 6 of Pentacles suggests a one-sided relationship where one partner may be giving more than the other. It can indicate strings attached to acts of kindness or a lack of genuine support. This card encourages you to examine the dynamics of your relationship and to address any imbalances that may be causing resentment or frustration. It's a reminder that true love requires effort and commitment from both partners. Focus on open communication and mutual support to restore harmony in your love life."
    },
    "career": {
      "upright": "The 6 of Pentacles upright signifies generosity and balance in the workplace. It represents the importance of giving and receiving support among colleagues and the value of sharing resources and knowledge. This card encourages you to embrace a generous mindset and to recognize the impact of your actions on those around you. It's a reminder that true success comes from a balanced exchange of energy and resources. Embrace the harmonious energy of this card, and allow yourself to create a positive flow of giving and receiving at work.",
      "reversed": "Reversed, the 6 of Pentacles indicates imbalance in professional relationships, selfishness, and strings attached. You may be struggling to find harmony in your workplace or to manage your resources effectively. This card suggests the need to reassess your approach to generosity and to address any imbalances that may be hindering your professional relationships. It's a reminder that true success comes from a balanced exchange of energy and resources. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to create a positive flow of giving and receiving at work."
    }
  },
  "7 of Pentacles": {
    "general": {
      "upright": "This card signifies the importance of patience and long-term planning. It encourages you to take a step back and evaluate your progress, reminding you that success takes time and effort. Embrace the journey and trust the process. By staying dedicated to your goals and nurturing your efforts, you can achieve lasting results. This is a time to focus on perseverance and to remain committed to your vision for the future.",
      "reversed": "In reverse, the 7 of Pentacles suggests impatience and a lack of long-term vision. You may be feeling frustrated with your progress or questioning the value of your efforts. This card encourages you to reassess your goals and to consider whether you are truly investing in your future. It's a reminder that success requires dedication and a willingness to put in the necessary work over time. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate patience and perseverance."
    },
    "love": {
      "upright": "In terms of love, the 7 of Pentacles upright signifies patience and long-term commitment in relationships. It represents the importance of nurturing your connection and allowing it to grow over time. This card encourages you to embrace the journey of love and to trust that your efforts will lead to a fulfilling partnership. By staying dedicated to your relationship and investing in its growth, you can build a strong foundation for the future.",
      "reversed": "Reversed, the 7 of Pentacles indicates impatience in relationships and a lack of long-term vision. You may be feeling frustrated with the pace of your romantic life or questioning the value of your efforts. This card encourages you to reassess your relationship goals and to consider whether you are truly investing in a meaningful connection. It's a reminder that lasting love requires dedication and patience. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate patience and perseverance in your relationship."
    },
    "career": {
      "upright": "In terms of career, the 7 of Pentacles upright signifies long-term investment and sustainable success. It represents the importance of perseverance and dedication to your professional goals. This card encourages you to stay committed to your path and to trust that your hard work will pay off over time. By nurturing your skills and focusing on your vision, you can achieve lasting success in your career. This is a time to focus on patience and long-term planning.",
      "reversed": "In reverse, the 7 of Pentacles suggests impatience with career progress and a lack of long-term planning. You may be feeling frustrated with your current job situation or questioning the value of your efforts. This card encourages you to reassess your career goals and to consider whether you are truly investing in your professional growth. It's a reminder that sustainable success requires dedication and a willingness to put in the necessary work over time."
    }
  },
  "8 of Pentacles": {
    "general": {
      "upright": "The 8 of Pentacles upright signifies diligence, skill development, and quality craftsmanship. It represents the importance of hard work and dedication in achieving mastery and success. This card encourages you to embrace a focused mindset and to take pride in your efforts. It's a reminder that true accomplishment comes from consistent practice and attention to detail. Embrace the industrious energy of this card, and allow yourself to grow and improve through your work. This is a time to focus on self-development and the pursuit of excellence.",
      "reversed": "In reverse, the 8 of Pentacles suggests a lack of focus and direction in your work. You may be feeling overwhelmed by the details or struggling to maintain your standards. This card encourages you to reassess your approach and to consider whether you are truly committed to your craft. It's a reminder that mastery requires dedication and a willingness to put in the necessary effort."
    },
    "love": {
      "upright": "In terms of love, the 8 of Pentacles upright signifies working on relationship skills and a commitment to improvement. It represents the importance of putting in the effort to nurture your connection and to grow together as a couple. This card encourages you to embrace the journey of love and to trust that your dedication will lead to a stronger partnership.",
      "reversed": "In reverse, the 8 of Pentacles indicates perfectionism in love and misdirected relationship efforts. You may be focusing too much on the details or trying to achieve an idealized version of love. This card encourages you to reassess your approach and to consider whether you are truly investing in a healthy and balanced relationship."
    },
    "career": {
      "upright": "In terms of career, the 8 of Pentacles upright signifies skill development, mastery, and quality work. It represents the importance of dedication and hard work in achieving your professional goals. This card encourages you to embrace a mindset of continuous improvement and to take pride in the quality of your work. It's a reminder that true success comes from consistent effort and attention to detail. Embrace the industrious energy of this card, and allow yourself to grow and excel in your career.",
      "reversed": "In reverse, the 8 of Pentacles suggests perfectionism at work and misdirected efforts. You may be focusing too much on the details or struggling to maintain your standards. This card encourages you to reassess your approach and to consider whether you are truly committed to your craft. It's a reminder that mastery requires dedication and a willingness to put in the necessary effort."
    }
  },
  "9 of Pentacles": {
    "general": {
      "upright": "This card signifies financial independence, luxury, and self-sufficiency. It represents the rewards of hard work and the ability to enjoy the fruits of your labor. This card encourages you to embrace a mindset of abundance and to take pride in your achievements. It's a reminder that true wealth comes from within and that by cultivating self-worth, you can create a life of comfort and security. Embrace the empowering energy of this card, and allow yourself to enjoy the luxuries that come from your efforts. This is a time to focus on self-care and personal fulfillment.",
      "reversed": "In reverse, the 9 of Pentacles indicates over-investment in work, superficial success, and a lack of true fulfillment. You may be struggling to find balance in your life or to appreciate the rewards of your efforts. This card suggests the need to reassess your priorities and to focus on what truly brings you joy and satisfaction. It's a reminder that true wealth comes from within and that by cultivating self-worth, you can create a life of comfort and security. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to find true fulfillment in your life."
    },
    "love": {
      "upright": "In love, the 9 of Pentacles upright signifies a relationship built on mutual respect, independence, and shared abundance. It represents the importance of maintaining individuality within a partnership and the ability to enjoy the fruits of your collective efforts. This card encourages you to embrace a mindset of abundance in your relationship and to take pride in your achievements together. It's a reminder that true love thrives when both partners feel secure and fulfilled. Embrace the empowering energy of this card, and allow yourself to enjoy a luxurious and satisfying relationship.",
      "reversed": "Reversed, the 9 of Pentacles indicates over-investment in work, superficial success, and a lack of true fulfillment in your relationship. You may be struggling to find balance between your personal achievements and your romantic life. This card suggests the need to reassess your priorities and to focus on what truly brings you joy and satisfaction in love. It's a reminder that true wealth in relationships comes from mutual respect and emotional connection. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate a fulfilling and prosperous relationship."
    },
    "career": {
      "upright": "The 9 of Pentacles upright signifies financial independence, career success, and personal fulfillment. It represents the rewards of hard work and the ability to enjoy the fruits of your labor in your professional life. This card encourages you to embrace a mindset of abundance and to take pride in your achievements at work. It's a reminder that true success comes from within and that by cultivating self-worth, you can create a fulfilling and prosperous career. Embrace the empowering energy of this card, and allow yourself to enjoy the luxuries that come from your efforts.",
      "reversed": "Reversed, the 9 of Pentacles indicates over-investment in work, superficial success, and a lack of true fulfillment in your career. You may be struggling to find balance in your professional life or to appreciate the rewards of your efforts. This card suggests the need to reassess your priorities and to focus on what truly brings you joy and satisfaction in your work. It's a reminder that true success comes from within and that by cultivating self-worth, you can create a fulfilling and prosperous career. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to find true fulfillment in your professional life."
    }
  },
  "10 of Pentacles": {
    "general": {
      "upright": "When upright, the 10 of Pentacles signifies family wealth, long-term financial security, and legacy. It represents the culmination of hard work and the establishment of a stable foundation for future generations. This card encourages you to embrace a mindset of abundance and to focus on building a lasting legacy. It's a reminder that true wealth comes from creating a secure and prosperous environment for yourself and your loved ones. Embrace the grounding energy of this card, and allow yourself to create a stable and abundant future.",
      "reversed": "Reversed, the 10 of Pentacles indicates family financial problems, lack of relationship security, and instability. You may be struggling to maintain a stable foundation in your financial life or to create a secure environment for your loved ones. This card suggests the need to reassess your approach to wealth and legacy. It's a reminder that true security comes from careful planning and practical action. Focus on self-reflection and seek support from others if needed. Embrace the grounding energy of this card, and allow yourself to build a solid foundation for your future."
    },
    "love": {
      "upright": "When upright, the 10 of Pentacles signifies a stable and prosperous family life built on long-term commitment and security. It represents the importance of creating a lasting legacy through strong relationships and shared values. This card encourages you to embrace a mindset of abundance in your love life and to focus on building a secure and fulfilling partnership. It's a reminder that true wealth in relationships comes from mutual support and understanding. Embrace the grounding energy of this card, and allow yourself to create a stable and abundant future with your loved ones.",
      "reversed": "Reversed, the 10 of Pentacles indicates family relationship problems, lack of security, and instability in love. You may be struggling to maintain a stable foundation in your romantic life or to create a secure environment for your partnership. This card suggests the need to reassess your approach to relationships and legacy. It's a reminder that true security in love comes from careful planning and practical action. Focus on self-reflection and seek support from others if needed. Embrace the grounding energy of this card, and allow yourself to build a solid foundation for your future in love."
    },
    "career": {
      "upright": "When upright, the 10 of Pentacles signifies a successful career built on long-term planning and stability. It represents the importance of creating a lasting legacy through your professional achievements and contributions. This card encourages you to embrace a mindset of abundance in your career and to focus on building a secure and fulfilling professional life. It's a reminder that true success comes from hard work and dedication. Embrace the grounding energy of this card, and allow yourself to create a stable and prosperous future in your career.",
      "reversed": "Reversed, the 10 of Pentacles indicates career instability, lack of long-term success, and financial problems. You may be struggling to maintain a stable foundation in your professional life or to create a secure environment for your career growth. This card suggests the need to reassess your approach to work and legacy. It's a reminder that true security in your career comes from careful planning and practical action. Focus on self-reflection and seek support from others if needed. Embrace the grounding energy of this card, and allow yourself to build a solid foundation for your future in your career."
    }
  },
  "Page of Pentacles": {
    "general": {
      "upright": "This card signifies new beginnings, ambition, and the pursuit of knowledge. It represents the excitement of embarking on a new venture or learning a new skill. This card encourages you to embrace a curious mindset and to be open to opportunities for growth and development. It's a reminder that true success comes from a willingness to learn and adapt. Embrace the youthful energy of this card, and allow yourself to explore new possibilities. This is a time to focus on setting goals and taking the first steps toward achieving them.",
      "reversed": "In reverse, the Page of Pentacles indicates lack of progress, missed opportunities, and a need for focus. You may be struggling to stay motivated or to find direction in your pursuits. This card suggests the need to reassess your goals and to consider whether you are truly committed to your growth and development. It's a reminder that true success requires dedication and a willingness to put in the necessary effort. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain focus and motivation."
    },
    "love": {
      "upright": "New romantic opportunities, youthful energy, learning about love. This card represents the excitement of embarking on a new romantic journey or exploring new aspects of love. It encourages you to embrace a curious mindset and to be open to opportunities for growth in your relationships. It's a reminder that true love thrives on a willingness to learn and adapt. Embrace the youthful energy of this card, and allow yourself to explore new possibilities in love.",
      "reversed": "Lack of progress in love, missed romantic opportunities, need for focus. You may be struggling to stay motivated or to find direction in your romantic life. This card suggests the need to reassess your relationship goals and to consider whether you are truly committed to your growth in love. It's a reminder that true love requires dedication and a willingness to put in the necessary effort. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain focus and motivation in your love life."
    },
    "career": {
      "upright": "New career opportunities, ambition, learning new skills. This card represents the excitement of embarking on a new professional journey or acquiring new knowledge. It encourages you to embrace a curious mindset and to be open to opportunities for growth in your career. It's a reminder that true success comes from a willingness to learn and adapt. Embrace the youthful energy of this card, and allow yourself to explore new possibilities in your professional life. This is a time to focus on setting career goals and taking the first steps toward achieving them.",
      "reversed": "Lack of progress at work, missed career opportunities, need for focus. You may be struggling to stay motivated or to find direction in your professional life. This card suggests the need to reassess your career goals and to consider whether you are truly committed to your growth and development. It's a reminder that true success requires dedication and a willingness to put in the necessary effort. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain focus and motivation in your career."
    }
  },
  "Knight of Pentacles": {
    "general": {
      "upright": "Knight of Pentacles upright signifies hard work, reliability, and a methodical approach to achieving goals. It represents the importance of perseverance and dedication in your pursuits. This card encourages you to embrace a disciplined mindset and to focus on steady progress. It's a reminder that true success comes from consistent effort and attention to detail. Embrace the dependable energy of this card, and allow yourself to build a solid foundation for your future. This is a time to focus on self-discipline and long-term planning.",
      "reversed": "Reversed, the Knight of Pentacles indicates feeling stuck, boredom, and perfectionism. You may be struggling to maintain motivation or to find excitement in your pursuits. This card suggests the need to reassess your approach and to consider whether you are truly committed to your goals. It's a reminder that true success requires dedication and a willingness to put in the necessary effort. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain enthusiasm and motivation."
    },
    "love": {
      "upright": "Reliable partner, steady relationship, practical love. This card represents the importance of stability and consistency in your romantic life. It encourages you to embrace a dependable mindset and to focus on building a solid foundation for your relationship. It's a reminder that true love thrives on trust and commitment. Embrace the dependable energy of this card, and allow yourself to nurture a steady and fulfilling partnership. This is a time to focus on long-term planning and mutual support in your relationship.",
      "reversed": "Feeling stuck in love, relationship boredom, perfectionism. You may be struggling to maintain excitement or to find fulfillment in your romantic life. This card suggests the need to reassess your approach to love and to consider whether you are truly committed to your relationship. It's a reminder that true love requires effort and a willingness to put in the necessary work. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain enthusiasm and motivation in your love life."
    },
    "career": {
      "upright": "Hardworking employee, reliable at work, methodical approach. This card represents the importance of diligence and consistency in your professional life. It encourages you to embrace a disciplined mindset and to focus on steady progress in your career. It's a reminder that true success comes from consistent effort and attention to detail. Embrace the dependable energy of this card, and allow yourself to build a solid foundation for your professional future. This is a time to focus on self-discipline and long-term planning in your career.",
      "reversed": "Feeling stuck at work, job boredom, perfectionism. You may be struggling to maintain motivation or to find excitement in your professional life. This card suggests the need to reassess your approach to your career and to consider whether you are truly committed to your goals. It's a reminder that true success requires dedication and a willingness to put in the necessary effort. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain enthusiasm and motivation in your career."
    }
  },
  "Queen of Pentacles": {
    "general": {
      "upright": "The Queen of Pentacles upright signifies nurturing, practicality, and financial security. It represents the importance of balancing your material needs with your emotional well-being. This card encourages you to embrace a grounded mindset and to take care of both yourself and those around you. It's a reminder that true abundance comes from a harmonious blend of practicality and compassion. Embrace the nurturing energy of this card, and allow yourself to create a stable and supportive environment. This is a time to focus on financial independence and self-care.",
      "reversed": "Reversed, the Queen of Pentacles indicates work-life imbalance, financial insecurity, and neglecting self-care. You may be struggling to find harmony between your material needs and your emotional well-being. This card suggests the need to reassess your priorities and to focus on creating a more balanced and supportive environment. It's a reminder that true abundance comes from taking care of both yourself and those around you. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate financial independence and self-care."
    },
    "love": {
      "upright": "Nurturing partner, practical love, stable relationship. This card represents the importance of balancing your emotional needs with your material well-being in your romantic life. It encourages you to embrace a grounded approach to love and to focus on building a solid foundation for your relationship. It's a reminder that true love thrives on trust and commitment. Embrace the nurturing energy of this card, and allow yourself to cultivate a stable and fulfilling partnership.",
      "reversed": "Work-life conflict in love, struggling with relationship stability. You may be finding it difficult to balance your emotional needs with your material well-being in your romantic life. This card suggests the need to reassess your priorities and to focus on creating a more balanced and supportive environment in your relationship. It's a reminder that true love thrives when both partners feel secure and cared for. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate a stable and nurturing partnership."
    },
    "career": {
      "upright": "Nurturing boss, practical approach to work, financial security. This card represents the importance of balancing your professional responsibilities with your personal well-being. It encourages you to embrace a grounded mindset and to take care of both yourself and your work environment. It's a reminder that true success comes from a harmonious blend of practicality and compassion. Embrace the nurturing energy of this card, and allow yourself to create a stable and supportive work environment. This is a time to focus on financial independence and self-care in your career.",
      "reversed": "Work-life imbalance at work, financial insecurity, neglecting self-care. You may be struggling to find harmony between your professional duties and your personal well-being. This card suggests the need to reassess your priorities and to focus on creating a more balanced and supportive work environment. It's a reminder that true success comes from taking care of both yourself and your professional responsibilities. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to cultivate financial independence and self-care in your career."
    }
  },
  "King of Pentacles": {
    "general": {
      "upright": "The King of Pentacles upright signifies financial stability, leadership, and abundance. It represents the importance of taking control of your material life and creating a secure foundation for yourself and those around you. This card encourages you to embrace a responsible mindset and to focus on building long-term wealth and success. It's a reminder that true abundance comes from wise management of resources and a commitment to your goals. Embrace the authoritative energy of this card, and allow yourself to create a prosperous and stable future. This is a time to focus on financial acumen and leadership.",
      "reversed": "Reversed, the King of Pentacles indicates financial mismanagement, greed, and instability. You may be struggling to maintain control over your material life or to create a secure foundation for yourself. This card suggests the need to reassess your approach to wealth and success. It's a reminder that true abundance comes from responsible management of resources and a commitment to your goals. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain financial stability and leadership."
    },
    "love": {
      "upright": "Stable partner, financially secure relationship, generous love. This card represents the importance of creating a solid foundation in your romantic life through financial stability and responsible management of resources. It encourages you to embrace a dependable mindset and to focus on building a prosperous and fulfilling partnership. It's a reminder that true love thrives when both partners feel secure and supported. Embrace the authoritative energy of this card, and allow yourself to cultivate a stable and abundant relationship.",
      "reversed": "Financial mismanagement in love, instability, greed. You may be struggling to maintain a secure foundation in your romantic life or to create a prosperous partnership. This card suggests the need to reassess your approach to relationships and wealth. It's a reminder that true love requires responsible management of resources and mutual support. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain stability and generosity in your relationship."
    },
    "career": {
      "upright": "Financially successful leader, responsible management, career abundance. This card represents the importance of taking control of your professional life and creating a secure foundation for your career growth. It encourages you to embrace a responsible mindset and to focus on building long-term success through wise management of resources. It's a reminder that true success comes from dedication to your goals and effective leadership. Embrace the authoritative energy of this card, and allow yourself to create a prosperous and stable future in your career.",
      "reversed": "Financial mismanagement at work, career instability, greed. You may be struggling to maintain control over your professional life or to create a secure foundation for your career growth. This card suggests the need to reassess your approach to work and success. It's a reminder that true success requires responsible management of resources and a commitment to your goals. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain financial stability and leadership in your career."
    }
  }
}