[
    {
        "timestamp": "2025-11-04 12:31:38",
        "spread_type": "Custom Spread",
        "cards": [
            {
                "name": "Page of Pentacles",
                "arcana": "Minor",
                "is_reversed": true,
                "meaning": "In reverse, the Page of Pentacles indicates lack of progress, missed opportunities, and a need for focus. You may be struggling to stay motivated or to find direction in your pursuits. This card suggests the need to reassess your goals and to consider whether you are truly committed to your growth and development. It's a reminder that true success requires dedication and a willingness to put in the necessary effort. Focus on self-reflection and seek support from others if needed. Embrace the transformative energy of this card, and allow yourself to regain focus and motivation."
            },
            {
                "name": "6 of Wands",
                "arcana": "Minor",
                "is_reversed": true,
                "meaning": "Reversed, the 6 of Wands indicates lack of recognition, self-doubt, and private achievement. You may be feeling overlooked or undervalued despite your efforts. This card suggests the need to focus on your inner confidence and self-worth rather than seeking external validation. Remember that true success comes from within, and your achievements are meaningful even if they go unnoticed by others."
            },
            {
                "name": "5 of Swords",
                "arcana": "Minor",
                "is_reversed": false,
                "meaning": "The 5 of Swords upright signifies conflict, disagreement, competition, and betrayal. It represents a time of tension and the need to navigate difficult situations. This card encourages you to confront challenges head-on and to find ways to resolve conflicts. It's a reminder that while winning may seem important, it's essential to consider the impact on others. Embrace the lessons learned from these experiences, and allow yourself to grow from adversity. This is a time to reflect on your values and to seek harmony in your interactions with others."
            }
        ],
        "reading_type": "General",
        "reflection": ""
    },
    {
        "timestamp": "2025-11-04 12:45:40",
        "spread_type": "Past-Present-Future",
        "cards": [
            {
                "name": "The High Priestess",
                "arcana": "Major",
                "is_reversed": false,
                "meaning": "The High Priestess upright represents intuition, reflection, and inner knowledge. It’s a reminder to pause and listen to your instincts before taking action. Not everything needs to be solved logically — some answers come from awareness and observation. This card encourages patience and trust in the process, suggesting that clarity will come with time. The High Priestess also signifies a connection to deeper wisdom and the subconscious mind. It’s a call to explore your inner world and embrace the mysteries of life. This card may also indicate a need for balance between your external actions and internal reflections, urging you to find harmony between doing and being."
            },
            {
                "name": "10 of Wands",
                "arcana": "Minor",
                "is_reversed": true,
                "meaning": "Reversed, the 10 of Wands indicates a release of burdens and the need to let go of responsibilities that are no longer serving you. It suggests a time of delegation and finding ways to lighten your load. This card encourages you to seek support from others and to prioritize self-care. Remember that it's okay to ask for help and to take a step back when needed. Balance is key to maintaining your well-being."
            },
            {
                "name": "Wheel of Fortune",
                "arcana": "Major",
                "is_reversed": true,
                "meaning": "Reversed, it can mean delays or feeling stuck. Patience is needed — every turn of the wheel eventually brings movement again. Avoid resisting change or forcing outcomes. Reflect on what’s blocking your progress and take steps to regain your momentum. The reversed Wheel of Fortune encourages you to find balance between effort and acceptance, reminding you that true growth comes from embracing the natural cycles of life. It may also suggest that you are trying to control situations or people in ways that are not productive, leading to frustration and setbacks. Letting go of the need for control can open up new paths and opportunities for growth."
            }
        ],
        "reading_type": "General",
        "reflection": ""
    }
]